
export const ApiResponse = [
    {
        "實施學年度": 108,
        "課程類型": "C",
        "MD5": "75ef922f3286482150eb6d7b199eaad4",
        "課程資料": [
            {
                "課程代碼": "108070406C2640101010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406C2640101010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406C2640101010207",
                "科目名稱": "數學",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406C264010101030B",
                "科目名稱": "公民與社會",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406C264010101040O",
                "科目名稱": "物理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406C264010101050V",
                "科目名稱": "美術",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406C264010101060Y",
                "科目名稱": "生涯規劃",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1106"
            },
            {
                "課程代碼": "108070406C2640101010713",
                "科目名稱": "資訊科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406C2640101010815",
                "科目名稱": "體育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406C2640101010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406C264010102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406C264010102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406C264010102000N",
                "科目名稱": "會計學",
                "授課學期學分節數": "332200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406C264010103F121",
                "科目名稱": "門市經營實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13F1"
            },
            {
                "課程代碼": "108070406C2640102030090",
                "科目名稱": "記帳實務",
                "授課學期學分節數": "111100",
                "授課學期開課方式": "0000--",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406C2640108D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            }
        ]
    },
    {
        "實施學年度": 108,
        "課程類型": "M",
        "MD5": "71ae5372da0465d5b9b91f5f4f5effa2",
        "課程資料": [
            {
                "課程代碼": "108070406M1119601010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "440000",
                "授課學期開課方式": "00----",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406M1119601010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "440000",
                "授課學期開課方式": "00----",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406M1119601010203",
                "科目名稱": "數學",
                "授課學期學分節數": "440000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406M1119601010309",
                "科目名稱": "歷史",
                "授課學期學分節數": "200000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406M111960101030A",
                "科目名稱": "地理",
                "授課學期學分節數": "200000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406M111960101040C",
                "科目名稱": "物理",
                "授課學期學分節數": "2B0000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406M111960101040E",
                "科目名稱": "生物",
                "授課學期學分節數": "B20000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406M111960101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406M111960101060Y",
                "科目名稱": "生涯規劃",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1106"
            },
            {
                "課程代碼": "108070406M1119601010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "B20000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406M1119601010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406M1119601010815",
                "科目名稱": "體育",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406M1119601010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406M111960201030B",
                "科目名稱": "公民與社會",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "2103"
            },
            {
                "課程代碼": "108070406M111960201040D",
                "科目名稱": "化學",
                "授課學期學分節數": "B20000",
                "授課學期開課方式": "00----",
                "課程屬性": "2104"
            },
            {
                "課程代碼": "108070406M1119607010309",
                "科目名稱": "歷史",
                "授課學期學分節數": "020000",
                "授課學期開課方式": "-0----",
                "課程屬性": "7103"
            },
            {
                "課程代碼": "108070406M111960701030A",
                "科目名稱": "地理",
                "授課學期學分節數": "020000",
                "授課學期開課方式": "-0----",
                "課程屬性": "7103"
            },
            {
                "課程代碼": "108070406M111960701040F",
                "科目名稱": "地球科學",
                "授課學期學分節數": "2B0000",
                "授課學期開課方式": "00----",
                "課程屬性": "7104"
            },
            {
                "課程代碼": "108070406M1119607010790",
                "科目名稱": "資訊科技應用",
                "授課學期學分節數": "2B0000",
                "授課學期開課方式": "00----",
                "課程屬性": "7107"
            },
            {
                "課程代碼": "108070406M1119608D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "DD----",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406M1119609D00001",
                "科目名稱": "彈性學習時間",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "9000"
            }
        ]
    },
    {
        "實施學年度": 108,
        "課程類型": "V",
        "MD5": "3ae5f6e5cce8f5c37cc13e268e0ee84d",
        "課程資料": [
            {
                "課程代碼": "108070406V2640101010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640101010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640101010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V2640101010309",
                "科目名稱": "歷史",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V264010101030A",
                "科目名稱": "地理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V264010101040O",
                "科目名稱": "物理",
                "授課學期學分節數": "010000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264010101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264010101040S",
                "科目名稱": "生物",
                "授課學期學分節數": "100000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264010101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V264010101050V",
                "科目名稱": "美術",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V2640101010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2640101010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640101010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640101010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V264010102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264010102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264010102000N",
                "科目名稱": "會計學",
                "授課學期學分節數": "332200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264010103F121",
                "科目名稱": "門市經營實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13F1"
            },
            {
                "課程代碼": "108070406V2640102010090",
                "科目名稱": "英語會話",
                "授課學期學分節數": "112200",
                "授課學期開課方式": "0000--",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640102010091",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640102030093",
                "科目名稱": "記帳實務",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406V2640102061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640102061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640107010091",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V2640107061101",
                "科目名稱": "生活管理",
                "授課學期學分節數": "1100AA",
                "授課學期開課方式": "00--00",
                "課程屬性": "7611"
            },
            {
                "課程代碼": "108070406V2640108D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V2640201010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640201010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640201010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V2640201010309",
                "科目名稱": "歷史",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V264020101030A",
                "科目名稱": "地理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V264020101040O",
                "科目名稱": "物理",
                "授課學期學分節數": "010000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264020101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264020101040S",
                "科目名稱": "生物",
                "授課學期學分節數": "100000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264020101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V264020101050V",
                "科目名稱": "美術",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V2640201010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2640201010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640201010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640201010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V264020102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264020102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264020102000N",
                "科目名稱": "會計學",
                "授課學期學分節數": "332200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264020103F225",
                "科目名稱": "國際貿易實務",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "13F2"
            },
            {
                "課程代碼": "108070406V2640202010090",
                "科目名稱": "英語會話",
                "授課學期學分節數": "112200",
                "授課學期開課方式": "0000--",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640202010091",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640202030093",
                "科目名稱": "記帳實務",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406V2640202061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640202061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640207010091",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V2640207061101",
                "科目名稱": "生活管理",
                "授課學期學分節數": "1100AA",
                "授課學期開課方式": "00--00",
                "課程屬性": "7611"
            },
            {
                "課程代碼": "108070406V2640208D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V2640401010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640401010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2640401010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V264040101030A",
                "科目名稱": "地理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V264040101040O",
                "科目名稱": "物理",
                "授課學期學分節數": "010000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264040101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264040101040S",
                "科目名稱": "生物",
                "授課學期學分節數": "100000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V264040101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V2640401010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2640401010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640401010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2640401010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V264040102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264040102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264040102000N",
                "科目名稱": "會計學",
                "授課學期學分節數": "332200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V264040103F329",
                "科目名稱": "程式語言與設計",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13F3"
            },
            {
                "課程代碼": "108070406V2640402010090",
                "科目名稱": "英語會話",
                "授課學期學分節數": "112200",
                "授課學期開課方式": "0000--",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640402010091",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2640402030093",
                "科目名稱": "記帳實務",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406V2640402061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640402061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2640407010091",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V2640407D30025",
                "科目名稱": "國際貿易實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "7300"
            },
            {
                "課程代碼": "108070406V2640407D30091",
                "科目名稱": "國際匯兌",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "7300"
            },
            {
                "課程代碼": "108070406V2640407D30092",
                "科目名稱": "造形設計實習",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "7300"
            },
            {
                "課程代碼": "108070406V2640407D30093",
                "科目名稱": "企業管理實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "7300"
            },
            {
                "課程代碼": "108070406V2640407D30095",
                "科目名稱": "文書處理",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "DD----",
                "課程屬性": "7300"
            },
            {
                "課程代碼": "108070406V2640408D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V2743301010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2743301010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2743301010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V274330101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V2743301010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2743301010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2743301010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2743301010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V274330102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V274330102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V274330103G12B",
                "科目名稱": "初階英語聽講練習",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G1"
            },
            {
                "課程代碼": "108070406V274330103G12E",
                "科目名稱": "初階英文閱讀與寫作練習",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G1"
            },
            {
                "課程代碼": "108070406V274330103G32Q",
                "科目名稱": "外語文書處理實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G3"
            },
            {
                "課程代碼": "108070406V2743302010090",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2743302010091",
                "科目名稱": "英文選讀",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2743302020090",
                "科目名稱": "英語口語練習",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V2743302020092",
                "科目名稱": "英文文法與句型",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V2743302061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2743302061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2743307010090",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V2743308D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V27433A1010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V27433A1010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V27433A1010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V27433A101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V27433A1010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V27433A1010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V27433A1010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V27433A1010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V27433A102000L",
                "科目名稱": "商業概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V27433A102000M",
                "科目名稱": "數位科技概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V27433A103G12B",
                "科目名稱": "初階英語聽講練習",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G1"
            },
            {
                "課程代碼": "108070406V27433A103G12E",
                "科目名稱": "初階英文閱讀與寫作練習",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G1"
            },
            {
                "課程代碼": "108070406V27433A103G32Q",
                "科目名稱": "外語文書處理實務",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "13G3"
            },
            {
                "課程代碼": "108070406V27433A2010090",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V27433A2010091",
                "科目名稱": "英文選讀",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V27433A2020090",
                "科目名稱": "英語口語練習",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V27433A2020092",
                "科目名稱": "英文文法與句型",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V27433A2061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "AAAAAA",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V27433A2061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "AAAAAA",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V27433A7010090",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V27433A7061190",
                "科目名稱": "特殊需求課程",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "7611"
            },
            {
                "課程代碼": "108070406V27433A8D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V2840601010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "333322",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2840601010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V2840601010207",
                "科目名稱": "數學",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V284060101040O",
                "科目名稱": "物理",
                "授課學期學分節數": "010000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V284060101040R",
                "科目名稱": "化學",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V284060101040S",
                "科目名稱": "生物",
                "授課學期學分節數": "100000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V284060101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V2840601010712",
                "科目名稱": "生活科技",
                "授課學期學分節數": "200000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2840601010713",
                "科目名稱": "資訊科技",
                "授課學期學分節數": "020000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1107"
            },
            {
                "課程代碼": "108070406V2840601010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2840601010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V2840601010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V284060102000Q",
                "科目名稱": "色彩原理",
                "授課學期學分節數": "200000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V284060103002R",
                "科目名稱": "繪畫基礎實習",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1300"
            },
            {
                "課程代碼": "108070406V284060103002T",
                "科目名稱": "基本設計實習",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1300"
            },
            {
                "課程代碼": "108070406V284060103002U",
                "科目名稱": "基礎圖學實習",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "1300"
            },
            {
                "課程代碼": "108070406V2840602010090",
                "科目名稱": "英語會話",
                "授課學期學分節數": "113300",
                "授課學期開課方式": "0000--",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2840602010091",
                "科目名稱": "數學演習",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V2840602020090",
                "科目名稱": "文字造形",
                "授課學期學分節數": "100000",
                "授課學期開課方式": "0-----",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V2840602030090",
                "科目名稱": "色彩應用",
                "授課學期學分節數": "020000",
                "授課學期開課方式": "-0----",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406V2840602030091",
                "科目名稱": "字體設計",
                "授課學期學分節數": "010000",
                "授課學期開課方式": "-0----",
                "課程屬性": "2300"
            },
            {
                "課程代碼": "108070406V2840602061102",
                "科目名稱": "社會技巧",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2840602061103",
                "科目名稱": "學習策略",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "2611"
            },
            {
                "課程代碼": "108070406V2840607010091",
                "科目名稱": "寫作指導",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "000000",
                "課程屬性": "7100"
            },
            {
                "課程代碼": "108070406V2840608D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V4092901010101",
                "科目名稱": "國語文",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V4092901010102",
                "科目名稱": "英語文",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1101"
            },
            {
                "課程代碼": "108070406V4092901010207",
                "科目名稱": "數學",
                "授課學期學分節數": "222200",
                "授課學期開課方式": "0000--",
                "課程屬性": "1102"
            },
            {
                "課程代碼": "108070406V409290101030B",
                "科目名稱": "公民與社會",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1103"
            },
            {
                "課程代碼": "108070406V409290101041C",
                "科目名稱": "自然科學",
                "授課學期學分節數": "111100",
                "授課學期開課方式": "0000--",
                "課程屬性": "1104"
            },
            {
                "課程代碼": "108070406V409290101050U",
                "科目名稱": "音樂",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1105"
            },
            {
                "課程代碼": "108070406V4092901010814",
                "科目名稱": "健康與護理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V4092901010815",
                "科目名稱": "體育",
                "授課學期學分節數": "222222",
                "授課學期開課方式": "000000",
                "課程屬性": "1108"
            },
            {
                "課程代碼": "108070406V4092901010916",
                "科目名稱": "全民國防教育",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "1109"
            },
            {
                "課程代碼": "108070406V409290102001I",
                "科目名稱": "服務導論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "1200"
            },
            {
                "課程代碼": "108070406V409290103005Z",
                "科目名稱": "基礎清潔實務",
                "授課學期學分節數": "300000",
                "授課學期開課方式": "0-----",
                "課程屬性": "1300"
            },
            {
                "課程代碼": "108070406V4092901030060",
                "科目名稱": "基礎清潔實作",
                "授課學期學分節數": "030000",
                "授課學期開課方式": "-0----",
                "課程屬性": "1300"
            },
            {
                "課程代碼": "108070406V409290103U267",
                "科目名稱": "基礎設備實作",
                "授課學期學分節數": "330000",
                "授課學期開課方式": "00----",
                "課程屬性": "13U2"
            },
            {
                "課程代碼": "108070406V409290103U96S",
                "科目名稱": "食材處理實作",
                "授課學期學分節數": "300000",
                "授課學期開課方式": "0-----",
                "課程屬性": "13U9"
            },
            {
                "課程代碼": "108070406V409290103U96T",
                "科目名稱": "基礎速食實作",
                "授課學期學分節數": "033000",
                "授課學期開課方式": "-00---",
                "課程屬性": "13U9"
            },
            {
                "課程代碼": "108070406V4092902010013",
                "科目名稱": "資訊科技",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V409290201001I",
                "科目名稱": "生活管理",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V4092902010090",
                "科目名稱": "家政與生活",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "2100"
            },
            {
                "課程代碼": "108070406V4092902020090",
                "科目名稱": "車輛清理概論",
                "授課學期學分節數": "220000",
                "授課學期開課方式": "00----",
                "課程屬性": "2200"
            },
            {
                "課程代碼": "108070406V4092902030066",
                "科目名稱": "",
                "授課學期學分節數": "",
                "授課學期開課方式": "",
                "課程屬性": ""
            },
            {
                "課程代碼": "108070406V4092907061190",
                "科目名稱": "特殊需求課程",
                "授課學期學分節數": "110000",
                "授課學期開課方式": "00----",
                "課程屬性": "7611"
            },
            {
                "課程代碼": "108070406V4092908D00001",
                "科目名稱": "團體活動時間",
                "授課學期學分節數": "333333",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "8000"
            },
            {
                "課程代碼": "108070406V4092909D00001",
                "科目名稱": "彈性學習時間",
                "授課學期學分節數": "111111",
                "授課學期開課方式": "DDDDDD",
                "課程屬性": "9000"
            }
        ]
    }
];