
export const ApiResponse = [
  {
      "實施學年度": 108,
      "課程類型": "H",
      "MD5": "bafe2dd876b3c3fd0701521376798ea5",
      "課程資料": [
          {
              "課程代碼": "108041305H11101A1010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "444422",
              "授課學期開課方式": "000000",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101A1010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "444420",
              "授課學期開課方式": "00000-",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101A1010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305H11101A1010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "220200",
              "授課學期開課方式": "00-0--",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101A101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "B2B000",
              "授課學期開課方式": "000---",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101A101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "111100",
              "授課學期開課方式": "0000--",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101A101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "110011",
              "授課學期開課方式": "00--00",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101A1010712",
              "科目名稱": "生活科技",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101A1010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101A1010815",
              "科目名稱": "體育",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "000000",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305H11101A2110A90",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101A2110A91",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101A5110B90",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101A5110B92",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101A5110D90",
              "科目名稱": "由電影看社會",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "11----",
              "課程屬性": "510D"
          },
          {
              "課程代碼": "108041305H11101A5110F90",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101A5110F97",
              "科目名稱": "商務英語",
              "授課學期學分節數": "0B0000",
              "授課學期開課方式": "-1----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101A8100001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "333333",
              "授課學期開課方式": "111111",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305H11101A9100001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "111111",
              "課程屬性": "9000"
          },
          {
              "課程代碼": "108041305H11101B1010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "444422",
              "授課學期開課方式": "000000",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101B1010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "444420",
              "授課學期開課方式": "00000-",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101B1010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305H11101B1010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "220200",
              "授課學期開課方式": "00-0--",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101B101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "B2B000",
              "授課學期開課方式": "000---",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101B101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "111100",
              "授課學期開課方式": "0000--",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101B101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "110011",
              "授課學期開課方式": "00--00",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101B1010712",
              "科目名稱": "生活科技",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101B1010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101B1010815",
              "科目名稱": "體育",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "000000",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305H11101B2110A90",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101B2110A91",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101B5110B90",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101B5110B92",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101B5110D90",
              "科目名稱": "由電影看社會",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "11----",
              "課程屬性": "510D"
          },
          {
              "課程代碼": "108041305H11101B5110F90",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101B5110F97",
              "科目名稱": "商務英語",
              "授課學期學分節數": "0B0000",
              "授課學期開課方式": "-1----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101B8100001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "333333",
              "授課學期開課方式": "111111",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305H11101B9100001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "111111",
              "課程屬性": "9000"
          }
      ]
  },
  {
      "實施學年度": 108,
      "課程類型": "M",
      "MD5": "cc7fd415b32ac97a099c14890cbd956c",
      "課程資料": [
          {
              "課程代碼": "108041305M1119601010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305M1119601010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305M1119601010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305M1119601010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305M111960101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305M111960101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305M111960101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305M111960101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305M111960101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "00----",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305M111960101060Y",
              "科目名稱": "生涯規劃",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1106"
          },
          {
              "課程代碼": "108041305M1119601010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305M1119601010814",
              "科目名稱": "健康與護理",
              "授課學期學分節數": "110000",
              "授課學期開課方式": "00----",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305M1119601010815",
              "科目名稱": "體育",
              "授課學期學分節數": "220000",
              "授課學期開課方式": "00----",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305M1119601010916",
              "科目名稱": "全民國防教育",
              "授課學期學分節數": "110000",
              "授課學期開課方式": "00----",
              "課程屬性": "1109"
          },
          {
              "課程代碼": "108041305M111960201030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "2103"
          },
          {
              "課程代碼": "108041305M111960201040E",
              "科目名稱": "生物",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "2104"
          },
          {
              "課程代碼": "108041305M1119607110090",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7100"
          },
          {
              "課程代碼": "108041305M1119607110091",
              "科目名稱": "職業試探",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7100"
          },
          {
              "課程代碼": "108041305M1119607110190",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110191",
              "科目名稱": "日語入門",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110192",
              "科目名稱": "生活英文",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110390",
              "科目名稱": "台灣觀光地理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7103"
          },
          {
              "課程代碼": "108041305M1119607110490",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7104"
          },
          {
              "課程代碼": "108041305M1119607110491",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7104"
          },
          {
              "課程代碼": "108041305M1119607110590",
              "科目名稱": "設計概論",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110591",
              "科目名稱": "插畫表現技法",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110592",
              "科目名稱": "跟著音樂去旅行",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110610",
              "科目名稱": "法律與生活",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7106"
          },
          {
              "課程代碼": "108041305M1119607110790",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7107"
          },
          {
              "課程代碼": "108041305M1119607110890",
              "科目名稱": "健康魔法師",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7108"
          },
          {
              "課程代碼": "108041305M1119608D00001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "330000",
              "授課學期開課方式": "DD----",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305M1119609D00001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "220000",
              "授課學期開課方式": "DD----",
              "課程屬性": "9000"
          }
      ]
  }
];