// https://console.1campus.net/api/moeproxy/get_all_courses?school_code=070406&year=111
export const ApiResponse = [
  {
    "實施學年度": 111,
    "課程類型": "C",
    "MD5": "c26723f56d7c61bc044a3b3a802e85ea",
    "課程資料": [
      {
        "課程代碼": "109070406C2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406C2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406C2640101030020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406C264010103F122",
        "科目名稱": "行銷實務",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "109070406C264010103F124",
        "科目名稱": "金融與證券投資實務",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "109070406C2640102030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406C2640107010003",
        "科目名稱": "數學",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640107010091",
        "科目名稱": "體適能",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640107010092",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640107020090",
        "科目名稱": "經濟應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406C2640107030091",
        "科目名稱": "會計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640107C10090",
        "科目名稱": "口語表達",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640107C10093",
        "科目名稱": "閱讀理解",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640107C30090",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640107C30092",
        "科目名稱": "基礎網頁設計",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406C2640109D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----DD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406C2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406C2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406C2640401030020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406C264040103F32A",
        "科目名稱": "資料庫應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "109070406C2640402030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406C2640407010003",
        "科目名稱": "數學",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640407010091",
        "科目名稱": "體適能",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640407010092",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640407020090",
        "科目名稱": "經濟應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406C2640407030023",
        "科目名稱": "會計軟體應用",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640407030091",
        "科目名稱": "會計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640407C10090",
        "科目名稱": "口語表達",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640407C10093",
        "科目名稱": "閱讀理解",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406C2640407C30090",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640407C30092",
        "科目名稱": "基礎網頁設計",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----CC",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406C2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406C2640409D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----DD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406C2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406C2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406C2640101010207",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "110070406C2640101010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406C264010101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "110070406C264010101050W",
        "科目名稱": "藝術生活",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "110070406C2640101010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406C264010102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406C264010102000O",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406C264010103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406C264010103F123",
        "科目名稱": "會計軟體應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "110070406C2640102030090",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406C2640107010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406C2640107010093",
        "科目名稱": "體適能",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406C2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406C2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406C2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406C2640401010207",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "110070406C2640401010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406C264040101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "110070406C264040101050W",
        "科目名稱": "藝術生活",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "110070406C2640401010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406C264040102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406C264040102000O",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406C264040103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406C264040103F328",
        "科目名稱": "多媒體製作與應用",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "110070406C2640402030090",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406C2640407010093",
        "科目名稱": "體適能",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406C2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406C2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640101010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640101010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264010101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264010101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264010101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640101010207",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406C264010101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406C264010101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406C264010101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406C264010101060Y",
        "科目名稱": "生涯規劃",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1106"
      },
      {
        "課程代碼": "111070406C2640101010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406C2640101010815",
        "科目名稱": "體育",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406C264010102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264010102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264010102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264010103F121",
        "科目名稱": "門市經營實務",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "111070406C2640102030090",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406C2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406C2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640401010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640401010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264040101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264040101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C264040101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406C2640401010207",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406C264040101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406C264040101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406C264040101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406C264040101060Y",
        "科目名稱": "生涯規劃",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1106"
      },
      {
        "課程代碼": "111070406C2640401010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406C2640401010815",
        "科目名稱": "體育",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406C264040102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264040102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264040102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406C264040103F329",
        "科目名稱": "程式語言與設計",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "111070406C2640402030090",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406C2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      }
    ]
  },
  {
    "實施學年度": 111,
    "課程類型": "M",
    "MD5": "c186a8adc7978e19bb05b0d1053e51b9",
    "課程資料": [
      {
        "課程代碼": "109070406M1119602160090",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406M1119707010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "004440",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M1119707010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "004420",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M1119707010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M1119707040102",
        "科目名稱": "語文表達與傳播應用",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707040103",
        "科目名稱": "各類文學選讀",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707040104",
        "科目名稱": "專題閱讀與研究",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707040105",
        "科目名稱": "英語聽講",
        "授課學期學分節數": "00002B",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707040107",
        "科目名稱": "英文作文",
        "授課學期學分節數": "0000B2",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707040194",
        "科目名稱": "英語簡報實務",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M111970704030A",
        "科目名稱": "族群、性別與國家的歷史",
        "授課學期學分節數": "00003C",
        "授課學期開課方式": "----00",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M111970704030B",
        "科目名稱": "科技、環境與藝術的歷史",
        "授課學期學分節數": "0000C3",
        "授課學期開課方式": "----00",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M111970704030C",
        "科目名稱": "空間資訊科技",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----0-",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M111970704030D",
        "科目名稱": "社會環境議題",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M111970704030F",
        "科目名稱": "民主政治與法律",
        "授課學期學分節數": "0000B2",
        "授課學期開課方式": "----00",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M111970705030E",
        "科目名稱": "現代社會與經濟",
        "授課學期學分節數": "00002B",
        "授課學期開課方式": "----00",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "109070406M1119707110290",
        "科目名稱": "統合數學",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M1119707110292",
        "科目名稱": "商用微積分",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----1",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M1119707140101",
        "科目名稱": "國學常識",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707140106",
        "科目名稱": "英文閱讀與寫作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707140193",
        "科目名稱": "英文繪本賞析與習作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707140195",
        "科目名稱": "應用文",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119707140209",
        "科目名稱": "數學乙",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----11",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "109070406M1119707140291",
        "科目名稱": "生活趣味數學",
        "授課學期學分節數": "000004",
        "授課學期開課方式": "-----1",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "109070406M1119707140373",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----1-",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M1119707140393",
        "科目名稱": "地理眼看天下",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----1",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M1119707140395",
        "科目名稱": "從電影看歷史",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----1",
        "課程屬性": "7403"
      },
      {
        "課程代碼": "109070406M1119708D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M1119709D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406M1119807010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "004440",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M1119807010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "004420",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M1119807010290",
        "科目名稱": "統合數學",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M1119807010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M1119807040102",
        "科目名稱": "語文表達與傳播應用",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040103",
        "科目名稱": "各類文學選讀",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040105",
        "科目名稱": "英語聽講",
        "授課學期學分節數": "00002B",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040106",
        "科目名稱": "英文閱讀與寫作",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040107",
        "科目名稱": "英文作文",
        "授課學期學分節數": "0000B2",
        "授課學期開課方式": "----00",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040192",
        "科目名稱": "英語簡報實務",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807040208",
        "科目名稱": "數學甲",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "109070406M111980704040L",
        "科目名稱": "選修物理-波動、光及聲音",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704040M",
        "科目名稱": "選修物理-電磁現象一",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704040N",
        "科目名稱": "選修物理-電磁現象二與量子現象",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704040Q",
        "科目名稱": "選修化學-化學反應與平衡一",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704040R",
        "科目名稱": "選修化學-化學反應與平衡二",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704040S",
        "科目名稱": "選修化學-有機化學與應用科技",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980704049C",
        "科目名稱": "物理探究",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M1119807140101",
        "科目名稱": "國學常識",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M1119807140193",
        "科目名稱": "應用文",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----11",
        "課程屬性": "7401"
      },
      {
        "課程代碼": "109070406M111980714040U",
        "科目名稱": "選修生物-動物體的構造與功能",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----1-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714040W",
        "科目名稱": "選修生物-生態、演化及生物多樣性",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----1",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M1119807140473",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----1-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M1119807140497",
        "科目名稱": "物理演算",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----1-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714049B",
        "科目名稱": "地球與環境",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----1-",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714049D",
        "科目名稱": "物理實驗",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----1",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714049E",
        "科目名稱": "化學實驗",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----1",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714049F",
        "科目名稱": "海島環境探索",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----1",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M111980714049G",
        "科目名稱": "物理計算技巧",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----1",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "109070406M1119808D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M1119809D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406M26F0207010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0207010192",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0207010193",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0207010194",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0207010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M26F0207010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M26F020704001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207040020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "0000B2",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207040023",
        "科目名稱": "會計軟體應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207040024",
        "科目名稱": "金融與證券投資實務",
        "授課學期學分節數": "00002B",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207040073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207040094",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F020705007W",
        "科目名稱": "會計學",
        "授課學期學分節數": "003322",
        "授課學期開課方式": "--0000",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "109070406M26F0207140092",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207140096",
        "科目名稱": "會計實習",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207140097",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0207140098",
        "科目名稱": "經濟實務",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0208D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M26F0209D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406M26F0907010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0907010192",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0907010193",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0907010194",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M26F0907010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M26F0907010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M26F090704001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0907040020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0907040028",
        "科目名稱": "多媒體製作與應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F090704002A",
        "科目名稱": "資料庫應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0907040073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000220",
        "授課學期開課方式": "---00-",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0907040092",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F090705007W",
        "科目名稱": "會計學",
        "授課學期學分節數": "003322",
        "授課學期開課方式": "--0000",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "109070406M26F0907140097",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0907140098",
        "科目名稱": "網頁程式設計",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F090714009A",
        "科目名稱": "報表編製與應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F090714009B",
        "科目名稱": "經濟實務",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F090714009E",
        "科目名稱": "數據實務應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M26F0908D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M26F0909D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406M27X1107010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M27X1107010192",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M27X1107010193",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M27X1107010194",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M27X1107010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M27X1107010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M27X110704001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X1107040093",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X1107040095",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X1107040098",
        "科目名稱": "英文繪本賞析與習作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X110704009A",
        "科目名稱": "英語簡報實務",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X110704009C",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X110705002D",
        "科目名稱": "高階英語聽講練習",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "109070406M27X110705002G",
        "科目名稱": "高階英文閱讀與寫作練習",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "109070406M27X1107140092",
        "科目名稱": "英文短文寫作",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X110714009B",
        "科目名稱": "新聞英文實作",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M27X1108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M27X1109D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406M28V1007010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M28V1007010192",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M28V1007010193",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M28V1007010194",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "109070406M28V1007010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "109070406M28V1007010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "109070406M28V100704002V",
        "科目名稱": "電腦向量繪圖實習",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----0-",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V100704002W",
        "科目名稱": "數位影像處理實習",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V100704002X",
        "科目名稱": "圖文編排實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V100704002Z",
        "科目名稱": "印刷與設計實務",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1007040035",
        "科目名稱": "影音製作實習",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1007040036",
        "科目名稱": "影音剪輯實習",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1007040073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1007040094",
        "科目名稱": "展示設計實習",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----0-",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V100705002S",
        "科目名稱": "表現技法實習",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "109070406M28V1007140092",
        "科目名稱": "包裝設計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1007140097",
        "科目名稱": "廣告設計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----11",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "109070406M28V1008D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406M28V1009D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M111970101050W",
        "科目名稱": "藝術生活",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "110070406M111970701000B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406M1119707010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "004440",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M1119707010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "004420",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M1119707010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M1119707050190",
        "科目名稱": "英文文法與句型",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7501"
      },
      {
        "課程代碼": "110070406M1119707050191",
        "科目名稱": "閱讀與寫作",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "7501"
      },
      {
        "課程代碼": "110070406M1119707050390",
        "科目名稱": "世界史",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119707050391",
        "科目名稱": "世界地理",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119707050392",
        "科目名稱": "地理觀點研討",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119707050393",
        "科目名稱": "歷史文獻選讀",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119707110204",
        "科目名稱": "數學A",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--11--",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M1119707110205",
        "科目名稱": "數學B",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--11--",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M1119707140474",
        "科目名稱": "自然科學探究與實作",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--11--",
        "課程屬性": "7404"
      },
      {
        "課程代碼": "110070406M111970715030G",
        "科目名稱": "探究與實作：歷史學探究",
        "授課學期學分節數": "002B00",
        "授課學期開課方式": "--11--",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M111970715030H",
        "科目名稱": "探究與實作：地理與人文社會科學研究",
        "授課學期學分節數": "00B200",
        "授課學期開課方式": "--11--",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119707C40090",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M1119707C40291",
        "科目名稱": "數學解題分析",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "110070406M1119707C40292",
        "科目名稱": "數學解題策略",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "110070406M1119707C40510",
        "科目名稱": "基本設計",
        "授課學期學分節數": "000100",
        "授課學期開課方式": "---C--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119707C40512",
        "科目名稱": "新媒體藝術",
        "授課學期學分節數": "000100",
        "授課學期開課方式": "---C--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119707C40590",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119707C40614",
        "科目名稱": "思考：智慧的啟航",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7406"
      },
      {
        "課程代碼": "110070406M1119707C40718",
        "科目名稱": "進階程式設計",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7407"
      },
      {
        "課程代碼": "110070406M1119707C40790",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7407"
      },
      {
        "課程代碼": "110070406M1119707C4081A",
        "科目名稱": "安全教育與傷害防護",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7408"
      },
      {
        "課程代碼": "110070406M1119707C40890",
        "科目名稱": "健康與情感自主管理",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7408"
      },
      {
        "課程代碼": "110070406M1119707C5030I",
        "科目名稱": "探究與實作：公共議題與社會探究",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "7503"
      },
      {
        "課程代碼": "110070406M1119708D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M1119709D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M1119807010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "004440",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M1119807010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "004420",
        "授課學期開課方式": "--000-",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M1119807010204",
        "科目名稱": "數學A",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M1119807010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M1119807050190",
        "科目名稱": "英文文法與句型",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7501"
      },
      {
        "課程代碼": "110070406M1119807050191",
        "科目名稱": "閱讀與寫作",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "7501"
      },
      {
        "課程代碼": "110070406M111980705040J",
        "科目名稱": "選修物理-力學一",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M111980705040K",
        "科目名稱": "選修物理-力學二與熱學",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M111980705040O",
        "科目名稱": "選修化學-物質與能量",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M111980705040P",
        "科目名稱": "選修化學-物質構造與反應速率",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M111980705040T",
        "科目名稱": "選修生物-細胞與遺傳",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M111980705040V",
        "科目名稱": "選修生物-生命的起源與植物體的構造與功能",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M1119807050474",
        "科目名稱": "自然科學探究與實作",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7504"
      },
      {
        "課程代碼": "110070406M1119807C40090",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M1119807C40290",
        "科目名稱": "數學解題分析",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "110070406M1119807C40291",
        "科目名稱": "數學解題策略",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7402"
      },
      {
        "課程代碼": "110070406M1119807C40510",
        "科目名稱": "基本設計",
        "授課學期學分節數": "000100",
        "授課學期開課方式": "---C--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119807C40512",
        "科目名稱": "新媒體藝術",
        "授課學期學分節數": "000100",
        "授課學期開課方式": "---C--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119807C40590",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7405"
      },
      {
        "課程代碼": "110070406M1119807C40614",
        "科目名稱": "思考：智慧的啟航",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7406"
      },
      {
        "課程代碼": "110070406M1119807C40718",
        "科目名稱": "進階程式設計",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7407"
      },
      {
        "課程代碼": "110070406M1119807C40790",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7407"
      },
      {
        "課程代碼": "110070406M1119807C4081A",
        "科目名稱": "安全教育與傷害防護",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---C--",
        "課程屬性": "7408"
      },
      {
        "課程代碼": "110070406M1119807C40890",
        "科目名稱": "健康與情感自主管理",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--C---",
        "課程屬性": "7408"
      },
      {
        "課程代碼": "110070406M1119808D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M1119809D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M26F0207010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0207010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0207010191",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0207010192",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0207010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M26F0207010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M26F0207040021",
        "科目名稱": "門市經營實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207040022",
        "科目名稱": "行銷實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207040094",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F020705007U",
        "科目名稱": "商業概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F020705007V",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F020705007W",
        "科目名稱": "會計學",
        "授課學期學分節數": "003322",
        "授課學期開課方式": "--0000",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F020705007X",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F0207C40025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C40090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C40091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C40092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C40095",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C40097",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0207C4009B",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0208D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M26F0209D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M26F0907010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0907010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0907010191",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0907010192",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M26F0907010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M26F0907010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M26F0907040029",
        "科目名稱": "程式語言與設計",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907040073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000220",
        "授課學期開課方式": "---00-",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907040094",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907040095",
        "科目名稱": "商業軟體應用",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907040097",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F090705007U",
        "科目名稱": "商業概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F090705007V",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F090705007W",
        "科目名稱": "會計學",
        "授課學期學分節數": "003322",
        "授課學期開課方式": "--0000",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F090705007X",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M26F0907C40025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C40090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C40091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C40092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C40096",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C40098",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0907C4009E",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M26F0908D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M26F0909D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M27X1107010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M27X1107010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M27X1107010191",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M27X1107010192",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M27X1107010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M27X1107010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M27X1107040073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "00B200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X110704007U",
        "科目名稱": "商業概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X110704007V",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X110705002B",
        "科目名稱": "初階英語聽講練習",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002C",
        "科目名稱": "中階英語聽講練習",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002E",
        "科目名稱": "初階英文閱讀與寫作練習",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002F",
        "科目名稱": "中階英文閱讀與寫作練習",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002H",
        "科目名稱": "英文商業書信寫作",
        "授課學期學分節數": "002B00",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002P",
        "科目名稱": "外語簡報實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X110705002Q",
        "科目名稱": "外語文書處理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M27X1107140093",
        "科目名稱": "英文文法與句型",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--11--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107140096",
        "科目名稱": "英語口語練習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--11--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C40025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C40090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C40091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C40092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C40099",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C4009B",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1107C4009E",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M27X1108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M27X1109D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406M28V1007010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M28V1007010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M28V1007010191",
        "科目名稱": "英語會話",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M28V1007010192",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "001111",
        "授課學期開課方式": "--0000",
        "課程屬性": "7101"
      },
      {
        "課程代碼": "110070406M28V1007010290",
        "科目名稱": "數學演習",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--0000",
        "課程屬性": "7102"
      },
      {
        "課程代碼": "110070406M28V1007010815",
        "科目名稱": "體育",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--0000",
        "課程屬性": "7108"
      },
      {
        "課程代碼": "110070406M28V100704002Y",
        "科目名稱": "基礎攝影實習",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007040034",
        "科目名稱": "數位與商業攝影實習",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007040091",
        "科目名稱": "文字造形",
        "授課學期學分節數": "001000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007040095",
        "科目名稱": "字體設計",
        "授課學期學分節數": "000100",
        "授課學期開課方式": "---0--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V100705002R",
        "科目名稱": "繪畫基礎實習",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V100705002T",
        "科目名稱": "基本設計實習",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V100705002U",
        "科目名稱": "基礎圖學實習",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V100705007Y",
        "科目名稱": "設計概論",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V100705007Z",
        "科目名稱": "色彩原理",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V1007050080",
        "科目名稱": "造形原理",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V1007050082",
        "科目名稱": "設計與生活美學",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "7500"
      },
      {
        "課程代碼": "110070406M28V1007140096",
        "科目名稱": "色彩應用",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---1--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007140099",
        "科目名稱": "設計實務",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--1---",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V100714009B",
        "科目名稱": "廣告企劃",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--11--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C40025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C40090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C40092",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C40094",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C40098",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C4009A",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1007C4009D",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--CC--",
        "課程屬性": "7400"
      },
      {
        "課程代碼": "110070406M28V1008D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "003333",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406M28V1009D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "002222",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "111070406M1119601010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M1119601010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M1119601010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M1119601010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M111960101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M111960101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M111960101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406M1119601010203",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406M1119601010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406M111960101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406M111960101040C",
        "科目名稱": "物理",
        "授課學期學分節數": "2B0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406M111960101040E",
        "科目名稱": "生物",
        "授課學期學分節數": "2B0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406M111960101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "2B0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406M111960101050W",
        "科目名稱": "藝術生活",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406M111960101060Y",
        "科目名稱": "生涯規劃",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1106"
      },
      {
        "課程代碼": "111070406M1119601010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "B20000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406M1119601010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406M1119601010815",
        "科目名稱": "體育",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406M1119601010916",
        "科目名稱": "全民國防教育",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1109"
      },
      {
        "課程代碼": "111070406M111960201030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "2103"
      },
      {
        "課程代碼": "111070406M111960201040D",
        "科目名稱": "化學",
        "授課學期學分節數": "B20000",
        "授課學期開課方式": "00----",
        "課程屬性": "2104"
      },
      {
        "課程代碼": "111070406M111960201040F",
        "科目名稱": "地球科學",
        "授課學期學分節數": "B20000",
        "授課學期開課方式": "00----",
        "課程屬性": "2104"
      },
      {
        "課程代碼": "111070406M1119602161102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "1-----",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "111070406M1119602161103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-1----",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "111070406M1119602161104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-1----",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "111070406M1119607010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "7103"
      },
      {
        "課程代碼": "111070406M111960701030A",
        "科目名稱": "地理",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "7103"
      },
      {
        "課程代碼": "111070406M1119608D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "DD----",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406M1119609D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "DD----",
        "課程屬性": "9000"
      }
    ]
  },
  {
    "實施學年度": 111,
    "課程類型": "V",
    "MD5": "499e09dc10526c154d6ff6d541b00bc0",
    "課程資料": [
      {
        "課程代碼": "109070406V2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V264010101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V2640101010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V2640101030020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406V264010103F124",
        "科目名稱": "金融與證券投資實務",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "109070406V2640102030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640102030090",
        "科目名稱": "經濟實務",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640102030092",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640102061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640102061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640107010090",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640107010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640107010092",
        "科目名稱": "應用數學",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640107020090",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406V2640107061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640107061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640107061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640107061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "00AA11",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640107B30090",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640107B30095",
        "科目名稱": "報表編製與應用",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640107D30091",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2640107D30096",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V2640109D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406V2640201010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2640201010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V264020101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V2640201010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V2640201030020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406V264020103F227",
        "科目名稱": "貿易英文實務",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "13F2"
      },
      {
        "課程代碼": "109070406V2640202030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640202030090",
        "科目名稱": "經濟實務",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640202030092",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640202061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640202061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640207010090",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640207010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640207010092",
        "科目名稱": "應用數學",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640207020090",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406V2640207061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640207061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640207061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640207061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640207B30090",
        "科目名稱": "貿易糾紛與索賠",
        "授課學期學分節數": "000040",
        "授課學期開課方式": "----B-",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640207B30094",
        "科目名稱": "進出口外匯實務",
        "授課學期學分節數": "000004",
        "授課學期開課方式": "-----B",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640207B30096",
        "科目名稱": "財務報表分析",
        "授課學期學分節數": "000004",
        "授課學期開課方式": "-----B",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640207B30097",
        "科目名稱": "報表編製與應用",
        "授課學期學分節數": "000040",
        "授課學期開課方式": "----B-",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640207D30091",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2640207D30098",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2640208D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V2640209D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406V2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2640401010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V264040101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V2640401010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V2640401030020",
        "科目名稱": "商業溝通",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406V2640402030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000220",
        "授課學期開課方式": "---00-",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640402030090",
        "科目名稱": "經濟實務",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640402030091",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2640402061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640402061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2640407010090",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640407010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640407010092",
        "科目名稱": "應用數學",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2640407020090",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406V2640407030096",
        "科目名稱": "報表編製與應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640407061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640407061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2640407B30094",
        "科目名稱": "網頁程式設計",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640407B30098",
        "科目名稱": "數據實務應用",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V2640409D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406V2743301010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2743301010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V274330101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V274330101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V274330101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "000001",
        "授課學期開課方式": "-----0",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "109070406V274330101040S",
        "科目名稱": "生物",
        "授課學期學分節數": "000001",
        "授課學期開課方式": "-----0",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "109070406V274330101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "109070406V274330101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "109070406V2743301010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V274330103G12D",
        "科目名稱": "高階英語聽講練習",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "109070406V274330103G12G",
        "科目名稱": "高階英文閱讀與寫作練習",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "109070406V274330103G12H",
        "科目名稱": "英文商業書信寫作",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "109070406V2743302010091",
        "科目名稱": "英文選讀",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "109070406V2743302061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2743302061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2743307010090",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2743307010091",
        "科目名稱": "應用數學",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2743307020090",
        "科目名稱": "連鎖企業概論",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "109070406V2743307030090",
        "科目名稱": "電子商務",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2743307030094",
        "科目名稱": "計算機應用",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2743307061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2743307061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2743307061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2743307061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2743307B30095",
        "科目名稱": "英文短文寫作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2743307B30096",
        "科目名稱": "新聞英文實作",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2743307D30091",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2743307D30098",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2743308D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V2743309D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406V2840601010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V2840601010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "109070406V284060101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "109070406V2840601010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V284060103H12X",
        "科目名稱": "圖文編排實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "13H1"
      },
      {
        "課程代碼": "109070406V284060103H12Z",
        "科目名稱": "印刷與設計實務",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "13H1"
      },
      {
        "課程代碼": "109070406V284060103H435",
        "科目名稱": "影音製作實習",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "13H4"
      },
      {
        "課程代碼": "109070406V284060103H436",
        "科目名稱": "影音剪輯實習",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "13H4"
      },
      {
        "課程代碼": "109070406V2840602030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000330",
        "授課學期開課方式": "---00-",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2840602030092",
        "科目名稱": "廣告企劃",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V2840602061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2840602061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "109070406V2840607010090",
        "科目名稱": "英文閱讀",
        "授課學期學分節數": "000022",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2840607010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2840607010092",
        "科目名稱": "應用數學",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "109070406V2840607030095",
        "科目名稱": "展示設計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2840607061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2840607061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2840607061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2840607061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V2840607B30093",
        "科目名稱": "包裝設計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2840607B30097",
        "科目名稱": "廣告設計實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----BB",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V2840607D30091",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2840607D30098",
        "科目名稱": "",
        "授課學期學分節數": "",
        "授課學期開課方式": "",
        "課程屬性": ""
      },
      {
        "課程代碼": "109070406V2840608D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V2840609D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "109070406V409290101050W",
        "科目名稱": "藝術生活",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "109070406V409290101060Y",
        "科目名稱": "生涯規劃",
        "授課學期學分節數": "000011",
        "授課學期開課方式": "----00",
        "課程屬性": "1106"
      },
      {
        "課程代碼": "109070406V4092901010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "109070406V4092901030062",
        "科目名稱": "顧客服務實務",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----0-",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406V4092901030063",
        "科目名稱": "顧客服務實作",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "109070406V409290103U96U",
        "科目名稱": "飲料調製實作",
        "授課學期學分節數": "000030",
        "授課學期開課方式": "----0-",
        "課程屬性": "13U9"
      },
      {
        "課程代碼": "109070406V4092902010091",
        "科目名稱": "法律常識",
        "授課學期學分節數": "000020",
        "授課學期開課方式": "----0-",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "109070406V4092902030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000002",
        "授課學期開課方式": "-----0",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092902030090",
        "科目名稱": "飲料調製應用",
        "授課學期學分節數": "000003",
        "授課學期開課方式": "-----0",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092902030095",
        "科目名稱": "門市商品包裝與整理實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092902030097",
        "科目名稱": "餐飲製備實習",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092902030098",
        "科目名稱": "門市內場實習",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092902030099",
        "科目名稱": "顧客服務實習",
        "授課學期學分節數": "000033",
        "授課學期開課方式": "----00",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "109070406V4092907061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "000001",
        "授課學期開課方式": "-----0",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V4092907061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "000010",
        "授課學期開課方式": "----0-",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "109070406V4092907A30092",
        "科目名稱": "麵包實作",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----AA",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V4092907A30094",
        "科目名稱": "西式點心實作",
        "授課學期學分節數": "000044",
        "授課學期開課方式": "----AA",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "109070406V4092908D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "109070406V4092909D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2640101010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "110070406V2640101010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V264010102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264010102000O",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264010103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V264010103F122",
        "科目名稱": "行銷實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "110070406V264010103F123",
        "科目名稱": "會計軟體應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "110070406V2640102010003",
        "科目名稱": "數學",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640102010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640102010091",
        "科目名稱": "數學演習",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640102030092",
        "科目名稱": "會計實習",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2640102061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "AAAAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "110070406V2640107010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406V2640107061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640107061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640107061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640107D30025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30093",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30094",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640107D30097",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V2640109D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V2640201010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2640201010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2640201010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "110070406V2640201010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V264020102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264020102000O",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264020103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V264020103F225",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "13F2"
      },
      {
        "課程代碼": "110070406V264020103F226",
        "科目名稱": "會計軟體應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F2"
      },
      {
        "課程代碼": "110070406V2640202010003",
        "科目名稱": "數學",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640202010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640202010091",
        "科目名稱": "數學演習",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640202030092",
        "科目名稱": "會計實習",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2640202061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "AAAAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "110070406V2640207010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406V2640207061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640207061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640207061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640207D30090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640207D30091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640207D30092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640207D30094",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640207D30095",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640207D30099",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640208D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V2640209D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V264040101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406V264040101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "110070406V2640401010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V264040102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264040102000O",
        "科目名稱": "經濟學",
        "授課學期學分節數": "004400",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V264040103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V264040103F32A",
        "科目名稱": "資料庫應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "110070406V2640402010003",
        "科目名稱": "數學",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640402010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640402010091",
        "科目名稱": "數學演習",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2640402030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2640402030092",
        "科目名稱": "商業軟體應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2640402030094",
        "科目名稱": "專題入門與實務",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2640402061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "AAAAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "110070406V2640407010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406V2640407061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640407061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640407061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2640407D30025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30093",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30094",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640407D30098",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V2640409D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V2743301010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2743301010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2743301010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406V2743301010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "110070406V2743301010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V274330103001Z",
        "科目名稱": "數位科技應用",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V274330103G12C",
        "科目名稱": "中階英語聽講練習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "110070406V274330103G12F",
        "科目名稱": "中階英文閱讀與寫作練習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "110070406V274330103G32P",
        "科目名稱": "外語簡報實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "13G3"
      },
      {
        "課程代碼": "110070406V2743302010003",
        "科目名稱": "數學",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2743302010090",
        "科目名稱": "英文選讀",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2743302010091",
        "科目名稱": "數學演習",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2743302020091",
        "科目名稱": "英語口語練習",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2200"
      },
      {
        "課程代碼": "110070406V2743302030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2743302030090",
        "科目名稱": "英文段落寫作實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2743302030091",
        "科目名稱": "專題入門與實務",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2743302061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "AAAAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "110070406V2743307010090",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406V2743307061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2743307061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2743307061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2743307D30025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30092",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30095",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30096",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743307D30098",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2743308D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V2743309D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V2840601010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2840601010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V2840601010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406V284060101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406V284060101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "110070406V2840601010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V284060102000P",
        "科目名稱": "設計概論",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V284060102000R",
        "科目名稱": "造形原理",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V284060102000T",
        "科目名稱": "設計與生活美學",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V284060103002S",
        "科目名稱": "表現技法實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V284060103002V",
        "科目名稱": "電腦向量繪圖實習",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V284060103002W",
        "科目名稱": "數位影像處理實習",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V284060103H12Y",
        "科目名稱": "基礎攝影實習",
        "授課學期學分節數": "002000",
        "授課學期開課方式": "--0---",
        "課程屬性": "13H1"
      },
      {
        "課程代碼": "110070406V284060103H434",
        "科目名稱": "數位與商業攝影實習",
        "授課學期學分節數": "000200",
        "授課學期開課方式": "---0--",
        "課程屬性": "13H4"
      },
      {
        "課程代碼": "110070406V2840602010003",
        "科目名稱": "數學",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2840602010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "113300",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2840602010091",
        "科目名稱": "數學演習",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "110070406V2840602030073",
        "科目名稱": "專題實作",
        "授課學期學分節數": "000330",
        "授課學期開課方式": "---00-",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V2840602061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "AAAAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "110070406V2840607010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "110070406V2840607030096",
        "科目名稱": "設計實務",
        "授課學期學分節數": "001000",
        "授課學期開課方式": "--0---",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2840607061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2840607061104",
        "科目名稱": "職業教育",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V2840607D30025",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30090",
        "科目名稱": "人工智慧實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30091",
        "科目名稱": "文書處理",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30093",
        "科目名稱": "企業管理實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30095",
        "科目名稱": "國貿業務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30097",
        "科目名稱": "造形設計實習",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840607D30099",
        "科目名稱": "職場英語與國際溝通實務",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--DD--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V2840608D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V2840609D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "001122",
        "授課學期開課方式": "--DDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "110070406V4092901010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V4092901010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "110070406V4092901010208",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "110070406V4092901010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "110070406V409290101041C",
        "科目名稱": "自然科學",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "110070406V4092901010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "110070406V4092901010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "110070406V409290102001J",
        "科目名稱": "衛生與安全概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V409290102001K",
        "科目名稱": "事務機器與電腦應用概論",
        "授課學期學分節數": "002200",
        "授課學期開課方式": "--00--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "110070406V4092901030061",
        "科目名稱": "職場清潔實作",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "110070406V409290103U268",
        "科目名稱": "收銀台實作",
        "授課學期學分節數": "003000",
        "授課學期開課方式": "--0---",
        "課程屬性": "13U2"
      },
      {
        "課程代碼": "110070406V409290103U269",
        "科目名稱": "門市作業實作",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "13U2"
      },
      {
        "課程代碼": "110070406V409290103U96T",
        "科目名稱": "基礎速食實作",
        "授課學期學分節數": "033000",
        "授課學期開課方式": "-00---",
        "課程屬性": "13U9"
      },
      {
        "課程代碼": "110070406V4092902030092",
        "科目名稱": "烘焙點心實作",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--00--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V4092902030093",
        "科目名稱": "健康餐點實作",
        "授課學期學分節數": "000300",
        "授課學期開課方式": "---0--",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "110070406V4092907061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "001100",
        "授課學期開課方式": "--00--",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V4092907061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "00AAAA",
        "授課學期開課方式": "--0000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "110070406V4092907A30091",
        "科目名稱": "汽車美容實務",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--AA--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V4092907A30092",
        "科目名稱": "機車清潔實務",
        "授課學期學分節數": "003300",
        "授課學期開課方式": "--AA--",
        "課程屬性": "7300"
      },
      {
        "課程代碼": "110070406V4092908D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333333",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "110070406V4092909D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "9000"
      },
      {
        "課程代碼": "111070406V2640101010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640101010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640101010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640101010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264010101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264010101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264010101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640101010207",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V2640101010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406V264010101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406V264010101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "010000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264010101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264010101040S",
        "科目名稱": "生物",
        "授課學期學分節數": "100000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264010101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V264010101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V2640101010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2640101010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V2640101010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V264010102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264010102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264010102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264010103F121",
        "科目名稱": "門市經營實務",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13F1"
      },
      {
        "課程代碼": "111070406V2640102010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "111070406V2640102030091",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406V2640107010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V2640107061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640107061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640107061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640108D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V2640201010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640201010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640201010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640201010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264020101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264020101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264020101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640201010207",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V2640201010309",
        "科目名稱": "歷史",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406V264020101030A",
        "科目名稱": "地理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406V264020101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "010000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264020101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264020101040S",
        "科目名稱": "生物",
        "授課學期學分節數": "100000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264020101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V264020101050V",
        "科目名稱": "美術",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V2640201010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2640201010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V2640201010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V264020102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264020102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264020102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264020103F225",
        "科目名稱": "國際貿易實務",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "13F2"
      },
      {
        "課程代碼": "111070406V2640202010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "111070406V2640202030091",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406V2640207010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V2640207061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640207061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640207061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640208D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V2640401010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640401010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640401010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640401010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264040101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264040101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V264040101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2640401010207",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V264040101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V264040101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V2640401010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2640401010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2640401010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V2640401010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V264040102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264040102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264040102000N",
        "科目名稱": "會計學",
        "授課學期學分節數": "332200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V264040103F328",
        "科目名稱": "多媒體製作與應用",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "00----",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "111070406V264040103F329",
        "科目名稱": "程式語言與設計",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13F3"
      },
      {
        "課程代碼": "111070406V2640402010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "112200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "111070406V2640402030091",
        "科目名稱": "記帳實務",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406V2640407010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V2640407061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640407061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640407061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2640408D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V2743301010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2743301010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2743301010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2743301010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V274330101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V274330101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V274330101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2743301010207",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V274330101040R",
        "科目名稱": "化學",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V2743301010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2743301010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V2743301010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V274330102000L",
        "科目名稱": "商業概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V274330102000M",
        "科目名稱": "數位科技概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V274330103G12B",
        "科目名稱": "初階英語聽講練習",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "111070406V274330103G12E",
        "科目名稱": "初階英文閱讀與寫作練習",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13G1"
      },
      {
        "課程代碼": "111070406V274330103G32Q",
        "科目名稱": "外語文書處理實務",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "13G3"
      },
      {
        "課程代碼": "111070406V2743302010090",
        "科目名稱": "英文選讀",
        "授課學期學分節數": "223322",
        "授課學期開課方式": "000000",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "111070406V2743302020090",
        "科目名稱": "英文文法與句型",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "2200"
      },
      {
        "課程代碼": "111070406V2743302020091",
        "科目名稱": "英語口語練習",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "2200"
      },
      {
        "課程代碼": "111070406V2743307010090",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V2743307061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2743307061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2743307061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2743308D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V2840601010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2840601010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2840601010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2840601010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V284060101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V284060101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V284060101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V2840601010207",
        "科目名稱": "數學",
        "授課學期學分節數": "440000",
        "授課學期開課方式": "00----",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V284060101040O",
        "科目名稱": "物理",
        "授課學期學分節數": "010000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V284060101040S",
        "科目名稱": "生物",
        "授課學期學分節數": "100000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V284060101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V2840601010712",
        "科目名稱": "生活科技",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2840601010713",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1107"
      },
      {
        "課程代碼": "111070406V2840601010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V2840601010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V284060102000Q",
        "科目名稱": "色彩原理",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V284060103002R",
        "科目名稱": "繪畫基礎實習",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "00----",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "111070406V284060103002T",
        "科目名稱": "基本設計實習",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "00----",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "111070406V284060103002U",
        "科目名稱": "基礎圖學實習",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "00----",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "111070406V2840602010090",
        "科目名稱": "英語會話",
        "授課學期學分節數": "113300",
        "授課學期開課方式": "0000--",
        "課程屬性": "2100"
      },
      {
        "課程代碼": "111070406V2840602020090",
        "科目名稱": "文字造形",
        "授課學期學分節數": "200000",
        "授課學期開課方式": "0-----",
        "課程屬性": "2200"
      },
      {
        "課程代碼": "111070406V2840602030090",
        "科目名稱": "字體設計",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406V2840602030091",
        "科目名稱": "色彩應用",
        "授課學期學分節數": "020000",
        "授課學期開課方式": "-0----",
        "課程屬性": "2300"
      },
      {
        "課程代碼": "111070406V2840607010091",
        "科目名稱": "寫作指導",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "000000",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V2840607061102",
        "科目名稱": "社會技巧",
        "授課學期學分節數": "11AAAA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2840607061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "1111AA",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2840607061105",
        "科目名稱": "溝通訓練",
        "授課學期學分節數": "AAAA11",
        "授課學期開課方式": "000000",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V2840608D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V4092901010101",
        "科目名稱": "國語文",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V4092901010102",
        "科目名稱": "英語文",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V4092901010121",
        "科目名稱": "客語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V4092901010123",
        "科目名稱": "閩南語文",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V409290101012D",
        "科目名稱": "原住民族語文-阿美語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V409290101012K",
        "科目名稱": "閩東語文",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V409290101012L",
        "科目名稱": "臺灣手語",
        "授課學期學分節數": "AA0000",
        "授課學期開課方式": "00----",
        "課程屬性": "1101"
      },
      {
        "課程代碼": "111070406V4092901010203",
        "科目名稱": "數學",
        "授課學期學分節數": "222200",
        "授課學期開課方式": "0000--",
        "課程屬性": "1102"
      },
      {
        "課程代碼": "111070406V409290101030B",
        "科目名稱": "公民與社會",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1103"
      },
      {
        "課程代碼": "111070406V409290101041C",
        "科目名稱": "自然科學",
        "授課學期學分節數": "111100",
        "授課學期開課方式": "0000--",
        "課程屬性": "1104"
      },
      {
        "課程代碼": "111070406V409290101050U",
        "科目名稱": "音樂",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1105"
      },
      {
        "課程代碼": "111070406V4092901010814",
        "科目名稱": "健康與護理",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V4092901010815",
        "科目名稱": "體育",
        "授課學期學分節數": "222222",
        "授課學期開課方式": "000000",
        "課程屬性": "1108"
      },
      {
        "課程代碼": "111070406V409290102001I",
        "科目名稱": "服務導論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "1200"
      },
      {
        "課程代碼": "111070406V409290103005Z",
        "科目名稱": "基礎清潔實務",
        "授課學期學分節數": "300000",
        "授課學期開課方式": "0-----",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "111070406V4092901030060",
        "科目名稱": "基礎清潔實作",
        "授課學期學分節數": "030000",
        "授課學期開課方式": "-0----",
        "課程屬性": "1300"
      },
      {
        "課程代碼": "111070406V409290103U267",
        "科目名稱": "基礎設備實作",
        "授課學期學分節數": "330000",
        "授課學期開課方式": "00----",
        "課程屬性": "13U2"
      },
      {
        "課程代碼": "111070406V409290103U96S",
        "科目名稱": "食材處理實作",
        "授課學期學分節數": "300000",
        "授課學期開課方式": "0-----",
        "課程屬性": "13U9"
      },
      {
        "課程代碼": "111070406V409290103U96T",
        "科目名稱": "基礎速食實作",
        "授課學期學分節數": "033000",
        "授課學期開課方式": "-00---",
        "課程屬性": "13U9"
      },
      {
        "課程代碼": "111070406V4092902061101",
        "科目名稱": "生活管理",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "2611"
      },
      {
        "課程代碼": "111070406V4092907010013",
        "科目名稱": "資訊科技",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "7100"
      },
      {
        "課程代碼": "111070406V4092907020090",
        "科目名稱": "車輛清潔概論",
        "授課學期學分節數": "220000",
        "授課學期開課方式": "00----",
        "課程屬性": "7200"
      },
      {
        "課程代碼": "111070406V4092907061103",
        "科目名稱": "學習策略",
        "授課學期學分節數": "110000",
        "授課學期開課方式": "00----",
        "課程屬性": "7611"
      },
      {
        "課程代碼": "111070406V4092908D00001",
        "科目名稱": "團體活動時間",
        "授課學期學分節數": "333322",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "8000"
      },
      {
        "課程代碼": "111070406V4092909D00001",
        "科目名稱": "彈性學習時間",
        "授課學期學分節數": "111111",
        "授課學期開課方式": "DDDDDD",
        "課程屬性": "9000"
      }
    ]
  }
];
