
export const CodeTables = [
    {
        "name": "GRP",
        "content": [
            {
                "代碼": "11",
                "代碼說明": "學術群",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "11",
                "代碼說明": "學術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "21",
                "代碼說明": "機械群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "22",
                "代碼說明": "動力機械群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "23",
                "代碼說明": "電機與電子群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "24",
                "代碼說明": "化工群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "25",
                "代碼說明": "土木與建築群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "26",
                "代碼說明": "商業與管理群",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "26",
                "代碼說明": "商業群",
                "適用課程類型": "|M|E|F|"
            },
            {
                "代碼": "27",
                "代碼說明": "外語群",
                "適用課程類型": "|V|C|M|"
            },
            {
                "代碼": "28",
                "代碼說明": "設計群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "29",
                "代碼說明": "農業群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "30",
                "代碼說明": "食品群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "31",
                "代碼說明": "家政群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "32",
                "代碼說明": "餐旅群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "33",
                "代碼說明": "水產群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "34",
                "代碼說明": "海事群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "35",
                "代碼說明": "藝術群",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "代碼": "36",
                "代碼說明": "美容造型群",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "40",
                "代碼說明": "服務群",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "41",
                "代碼說明": "其他(綜合)",
                "適用課程類型": "|M|"
            }
        ]
    },
    {
        "name": "DEP",
        "content": [
            {
                "代碼": "099",
                "代碼說明": "其他",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "101",
                "代碼說明": "普通班",
                "適用課程類型": "|H|S|V|C|S|"
            },
            {
                "代碼": "102",
                "代碼說明": "音樂班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "103",
                "代碼說明": "美術班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "104",
                "代碼說明": "舞蹈班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "105",
                "代碼說明": "體育班",
                "適用課程類型": "|H|S|V|C|M|"
            },
            {
                "代碼": "106",
                "代碼說明": "數理資優班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "107",
                "代碼說明": "語文資優班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "108",
                "代碼說明": "科學班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "111",
                "代碼說明": "原住民藝能班",
                "適用課程類型": "|H|"
            },
            {
                "代碼": "121",
                "代碼說明": "雙語部",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "122",
                "代碼說明": "戲劇班",
                "適用課程類型": "|H|S|V|C|"
            },
            {
                "代碼": "123",
                "代碼說明": "人文與社會科學資優班",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "124",
                "代碼說明": "創造能力資優班",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "196",
                "代碼說明": "1年級不分群",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "197",
                "代碼說明": "學術社會學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "198",
                "代碼說明": "學術自然學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "201",
                "代碼說明": "農場經營科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "202",
                "代碼說明": "園藝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "204",
                "代碼說明": "森林科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "205",
                "代碼說明": "農業機械科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "206",
                "代碼說明": "食品加工科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "214",
                "代碼說明": "野生動物保育科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "215",
                "代碼說明": "農產行銷科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "216",
                "代碼說明": "造園科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "217",
                "代碼說明": "畜產保健科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "301",
                "代碼說明": "機械科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "302",
                "代碼說明": "鑄造科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "303",
                "代碼說明": "汽車科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "304",
                "代碼說明": "板金科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "305",
                "代碼說明": "資訊科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "306",
                "代碼說明": "電子科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "307",
                "代碼說明": "控制科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "308",
                "代碼說明": "電機科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "309",
                "代碼說明": "冷凍空調科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "311",
                "代碼說明": "建築科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "312",
                "代碼說明": "家具木工科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "315",
                "代碼說明": "化工科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "316",
                "代碼說明": "美工科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "318",
                "代碼說明": "美術工藝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "319",
                "代碼說明": "紡織科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "321",
                "代碼說明": "電機空調科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "331",
                "代碼說明": "機工科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "332",
                "代碼說明": "機械木模科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "335",
                "代碼說明": "汽車修護科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "337",
                "代碼說明": "配管科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "338",
                "代碼說明": "模具科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "352",
                "代碼說明": "染整科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "360",
                "代碼說明": "機電科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "361",
                "代碼說明": "陶瓷工程科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "363",
                "代碼說明": "製圖科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "364",
                "代碼說明": "重機科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "365",
                "代碼說明": "土木科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "366",
                "代碼說明": "室內空間設計科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "367",
                "代碼說明": "環境檢驗科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "371",
                "代碼說明": "電腦繪圖科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "372",
                "代碼說明": "生物產業機電科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "373",
                "代碼說明": "圖文傳播科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "374",
                "代碼說明": "電腦機械製圖科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "380",
                "代碼說明": "軌道車輛科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "381",
                "代碼說明": "飛機修護科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "384",
                "代碼說明": "航空電子科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "392",
                "代碼說明": "動力機械科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "394",
                "代碼說明": "金屬工藝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "397",
                "代碼說明": "消防工程科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "398",
                "代碼說明": "空間測繪科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "399",
                "代碼說明": "家具設計科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "401",
                "代碼說明": "商業經營科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "402",
                "代碼說明": "國際貿易科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "403",
                "代碼說明": "會計事務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "404",
                "代碼說明": "資料處理科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "406",
                "代碼說明": "廣告設計科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "407",
                "代碼說明": "觀光事業科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "408",
                "代碼說明": "餐飲管理科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "418",
                "代碼說明": "不動產事務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "424",
                "代碼說明": "餐飲服務科",
                "適用課程類型": "|C|"
            },
            {
                "代碼": "425",
                "代碼說明": "電子商務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "426",
                "代碼說明": "流通管理科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "427",
                "代碼說明": "餐旅管理科",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "429",
                "代碼說明": "休閒管理科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "430",
                "代碼說明": "多媒體設計科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "431",
                "代碼說明": "多媒體應用科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "432",
                "代碼說明": "電競經營科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "433",
                "代碼說明": "應用英語科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "434",
                "代碼說明": "應用日語科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "501",
                "代碼說明": "家政科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "502",
                "代碼說明": "服裝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "503",
                "代碼說明": "幼兒保育科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "504",
                "代碼說明": "美容科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "505",
                "代碼說明": "食品科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "512",
                "代碼說明": "室內設計科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "513",
                "代碼說明": "時尚模特兒科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "514",
                "代碼說明": "照顧服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "515",
                "代碼說明": "流行服飾科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "516",
                "代碼說明": "時尚造型科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "517",
                "代碼說明": "烘焙科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "701",
                "代碼說明": "漁業科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "702",
                "代碼說明": "輪機科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "703",
                "代碼說明": "電子通信科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "705",
                "代碼說明": "水產養殖科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "706",
                "代碼說明": "水產經營科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "708",
                "代碼說明": "航海科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "717",
                "代碼說明": "航運管理科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "718",
                "代碼說明": "水產食品科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "801",
                "代碼說明": "戲劇科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "802",
                "代碼說明": "音樂科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "803",
                "代碼說明": "舞蹈科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "804",
                "代碼說明": "美術科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "806",
                "代碼說明": "影劇科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "807",
                "代碼說明": "西樂科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "808",
                "代碼說明": "國樂科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "809",
                "代碼說明": "歌仔戲科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "813",
                "代碼說明": "劇場藝術科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "816",
                "代碼說明": "電影電視科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "817",
                "代碼說明": "表演藝術科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "820",
                "代碼說明": "多媒體動畫科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "821",
                "代碼說明": "客家戲科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "822",
                "代碼說明": "時尚工藝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "823",
                "代碼說明": "戲曲音樂科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "824",
                "代碼說明": "京劇科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "825",
                "代碼說明": "民俗技藝科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "826",
                "代碼說明": "原住民藝能科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "911",
                "代碼說明": "汽車美容服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "912",
                "代碼說明": "門市服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "913",
                "代碼說明": "農園藝整理服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "914",
                "代碼說明": "包裝服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "915",
                "代碼說明": "居家生活服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "916",
                "代碼說明": "餐飲服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "917",
                "代碼說明": "旅館服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "918",
                "代碼說明": "保健按摩服務科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "929",
                "代碼說明": "綜合職能科",
                "適用課程類型": "|H|V|C|"
            },
            {
                "代碼": "A01",
                "代碼說明": "機械技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A02",
                "代碼說明": "製圖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A03",
                "代碼說明": "製圖技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A04",
                "代碼說明": "機械製圖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A05",
                "代碼說明": "電腦製圖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A06",
                "代碼說明": "農業機械技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A07",
                "代碼說明": "電腦繪圖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A08",
                "代碼說明": "電腦輔助機械學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A09",
                "代碼說明": "機械學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A10",
                "代碼說明": "機械工程學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A12",
                "代碼說明": "鑄造技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A13",
                "代碼說明": "生物產業機電學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "A14",
                "代碼說明": "機械木模學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B01",
                "代碼說明": "汽車技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B02",
                "代碼說明": "汽車修護學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B03",
                "代碼說明": "航空技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B04",
                "代碼說明": "飛機修護學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B05",
                "代碼說明": "工程機械技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B06",
                "代碼說明": "汽機車技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B09",
                "代碼說明": "動力機械學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B10",
                "代碼說明": "動力機械技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "B11",
                "代碼說明": "工程機械學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C01",
                "代碼說明": "電子技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C02",
                "代碼說明": "資訊技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C03",
                "代碼說明": "電機技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C04",
                "代碼說明": "機電技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C05",
                "代碼說明": "冷凍空調學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C06",
                "代碼說明": "電器冷凍學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C07",
                "代碼說明": "航空電子技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C08",
                "代碼說明": "電腦應用學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C09",
                "代碼說明": "電腦通訊學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C11",
                "代碼說明": "資訊電子學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C12",
                "代碼說明": "資訊科技學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C16",
                "代碼說明": "機電整合學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C18",
                "代碼說明": "電機電子技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C19",
                "代碼說明": "電機電子學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "C20",
                "代碼說明": "控制學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "D01",
                "代碼說明": "化工技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "D02",
                "代碼說明": "環境檢驗技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "D04",
                "代碼說明": "化工學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "D05",
                "代碼說明": "衛生化工學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "E01",
                "代碼說明": "建築技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "E02",
                "代碼說明": "營建技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "E03",
                "代碼說明": "土木測量學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "E04",
                "代碼說明": "建築製圖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "E07",
                "代碼說明": "土木建築技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F01",
                "代碼說明": "資訊應用學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F02",
                "代碼說明": "會計事務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F03",
                "代碼說明": "國際貿易學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F04",
                "代碼說明": "商業服務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F05",
                "代碼說明": "商業經營學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F06",
                "代碼說明": "流通服務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F07",
                "代碼說明": "物流服務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F08",
                "代碼說明": "資料處理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F09",
                "代碼說明": "電子商務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F10",
                "代碼說明": "商業事務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F11",
                "代碼說明": "文書事務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F12",
                "代碼說明": "商業應用學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F13",
                "代碼說明": "商業學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F14",
                "代碼說明": "電腦平面動畫學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F15",
                "代碼說明": "流通管理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F22",
                "代碼說明": "商經實務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "F23",
                "代碼說明": "資訊處理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G01",
                "代碼說明": "造園技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G02",
                "代碼說明": "園藝技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G03",
                "代碼說明": "農園技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G04",
                "代碼說明": "畜產技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G06",
                "代碼說明": "精緻農業學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G08",
                "代碼說明": "畜產加工學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G09",
                "代碼說明": "園藝與休閒學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G10",
                "代碼說明": "綜合農業學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G11",
                "代碼說明": "休閒農業管理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "G12",
                "代碼說明": "畜產保健學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H01",
                "代碼說明": "美容學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H02",
                "代碼說明": "美容美髮學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H03",
                "代碼說明": "服裝製作學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H04",
                "代碼說明": "服裝設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H05",
                "代碼說明": "服裝學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H06",
                "代碼說明": "美容技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H07",
                "代碼說明": "家政學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H08",
                "代碼說明": "幼兒保育學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H09",
                "代碼說明": "時尚設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H10",
                "代碼說明": "幼老福利學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "H11",
                "代碼說明": "時尚造型學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "I01",
                "代碼說明": "影劇技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "I02",
                "代碼說明": "表演技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "J01",
                "代碼說明": "餐飲服務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J02",
                "代碼說明": "餐飲技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J03",
                "代碼說明": "餐飲製作學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J04",
                "代碼說明": "餐飲管理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J05",
                "代碼說明": "運動與休閒學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J06",
                "代碼說明": "休閒事務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J07",
                "代碼說明": "觀光事務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J08",
                "代碼說明": "觀光事業學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J09",
                "代碼說明": "觀光餐飲學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J11",
                "代碼說明": "觀光學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J13",
                "代碼說明": "運動休閒學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J14",
                "代碼說明": "運動與休閒管理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J17",
                "代碼說明": "觀光服務學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J18",
                "代碼說明": "餐飲經營學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "J19",
                "代碼說明": "食品烘焙學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "K01",
                "代碼說明": "農業技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K03",
                "代碼說明": "園藝技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K09",
                "代碼說明": "花藝技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K11",
                "代碼說明": "寵物經營科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K13",
                "代碼說明": "畜產加工科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K15",
                "代碼說明": "食品經營科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K17",
                "代碼說明": "茶葉技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K19",
                "代碼說明": "造園技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K21",
                "代碼說明": "烘焙食品科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K25",
                "代碼說明": "肉品加工科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "K27",
                "代碼說明": "休閒農業科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L01",
                "代碼說明": "汽車修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L03",
                "代碼說明": "水電技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L05",
                "代碼說明": "裝潢技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L15",
                "代碼說明": "機械修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L20",
                "代碼說明": "機械板金科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L21",
                "代碼說明": "汽車電機科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L23",
                "代碼說明": "視聽電子修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L25",
                "代碼說明": "塗裝技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L29",
                "代碼說明": "電機修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L31",
                "代碼說明": "家電技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L35",
                "代碼說明": "營造技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L37",
                "代碼說明": "微電腦修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L39",
                "代碼說明": "金屬工藝科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L41",
                "代碼說明": "竹木工藝科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L49",
                "代碼說明": "冷凍空調修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L50",
                "代碼說明": "冷凍空調技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L51",
                "代碼說明": "模具基礎技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L52",
                "代碼說明": "模具技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L55",
                "代碼說明": "電腦繪圖科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L58",
                "代碼說明": "金銀珠寶加工科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L59",
                "代碼說明": "機械加工科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L62",
                "代碼說明": "鑄造技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L63",
                "代碼說明": "機車修護科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L69",
                "代碼說明": "化工技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L71",
                "代碼說明": "染整技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L79",
                "代碼說明": "流行飾品製作科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "L81",
                "代碼說明": "服裝製作科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M03",
                "代碼說明": "廣告技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M05",
                "代碼說明": "商業事務科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M09",
                "代碼說明": "商用資訊科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M11",
                "代碼說明": "會計實務科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M14",
                "代碼說明": "觀光事務科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M15",
                "代碼說明": "文書處理科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M17",
                "代碼說明": "餐飲技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M19",
                "代碼說明": "銷售事務科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M21",
                "代碼說明": "中餐廚師科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M27",
                "代碼說明": "旅遊事務科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "M29",
                "代碼說明": "多媒體技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N01",
                "代碼說明": "西服科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N03",
                "代碼說明": "女裝科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N05",
                "代碼說明": "美髮技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N06",
                "代碼說明": "美髮造型科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N11",
                "代碼說明": "美顏技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N12",
                "代碼說明": "美容造型科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N23",
                "代碼說明": "飾品製作科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "N25",
                "代碼說明": "烹調技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P01",
                "代碼說明": "水產養殖技術科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P09",
                "代碼說明": "海事資訊處理科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P12",
                "代碼說明": "船舶機電科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P13",
                "代碼說明": "漁具製作科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P17",
                "代碼說明": "水產食品加工科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "P23",
                "代碼說明": "休閒漁業科",
                "適用課程類型": "|E|F|"
            },
            {
                "代碼": "Q01",
                "代碼說明": "水產養殖技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "Q02",
                "代碼說明": "水產養殖學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "R01",
                "代碼說明": "漁業學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "U01",
                "代碼說明": "原住民藝能學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "U02",
                "代碼說明": "電視廣播學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "U03",
                "代碼說明": "電影電視學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "U04",
                "代碼說明": "影視戲劇學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "U05",
                "代碼說明": "表演藝術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V01",
                "代碼說明": "廣告設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V02",
                "代碼說明": "室內設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V03",
                "代碼說明": "美工學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V04",
                "代碼說明": "多媒體製作學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V05",
                "代碼說明": "美工電腦設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V06",
                "代碼說明": "美工技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V07",
                "代碼說明": "商業設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V08",
                "代碼說明": "室內裝潢學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V09",
                "代碼說明": "家具技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V10",
                "代碼說明": "設計科技學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V11",
                "代碼說明": "美術設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V12",
                "代碼說明": "多媒體設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V14",
                "代碼說明": "圖文傳播學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V16",
                "代碼說明": "流行造型設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V17",
                "代碼說明": "空間設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V18",
                "代碼說明": "室內空間設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V19",
                "代碼說明": "造型設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V20",
                "代碼說明": "工藝設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "V22",
                "代碼說明": "視覺傳達設計學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "W01",
                "代碼說明": "食品加工學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "W03",
                "代碼說明": "食品技術學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "X02",
                "代碼說明": "應用日語學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "X03",
                "代碼說明": "應用德語學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "X04",
                "代碼說明": "應用法語學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "X11",
                "代碼說明": "應用英語學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "Y01",
                "代碼說明": "銀髮族活動管理學程",
                "適用課程類型": "|M|"
            },
            {
                "代碼": "Y02",
                "代碼說明": "綜合職能學程",
                "適用課程類型": "|M|"
            }
        ]
    },
    {
        "name": "CLA",
        "content": [
            {
                "代碼": "1",
                "代碼說明": "建教合作-輪調式",
                "適用課程類型": "|V|E|F|"
            },
            {
                "代碼": "2",
                "代碼說明": "建教合作-階梯式",
                "適用課程類型": "|V|E|F|"
            },
            {
                "代碼": "3",
                "代碼說明": "建教合作-實習式",
                "適用課程類型": "|V|E|F|"
            },
            {
                "代碼": "4",
                "代碼說明": "建教合作-其他式",
                "適用課程類型": "|V|E|F|"
            }
        ]
    },
    {
        "name": "CAT",
        "content": [
            {
                "代碼": "1",
                "代碼說明": "部定必修"
            },
            {
                "代碼": "2",
                "代碼說明": "校訂必修"
            },
            {
                "代碼": "3",
                "代碼說明": "選修-加深加廣選修"
            },
            {
                "代碼": "4",
                "代碼說明": "選修-補強性選修"
            },
            {
                "代碼": "5",
                "代碼說明": "選修-多元選修"
            },
            {
                "代碼": "6",
                "代碼說明": "選修-其他"
            },
            {
                "代碼": "7",
                "代碼說明": "校訂選修"
            },
            {
                "代碼": "8",
                "代碼說明": "團體活動時間"
            },
            {
                "代碼": "9",
                "代碼說明": "彈性學習時間"
            },
            {
                "代碼": "A",
                "代碼說明": "大學預修課程"
            },
            {
                "代碼": "B",
                "代碼說明": "基礎訓練"
            },
            {
                "代碼": "C",
                "代碼說明": "職前訓練"
            },
            {
                "代碼": "D",
                "代碼說明": "寒暑假課程"
            },
            {
                "代碼": "E",
                "代碼說明": "返校課程"
            },
            {
                "代碼": "F",
                "代碼說明": "職業技能訓練"
            }
        ]
    },
    {
        "name": "FLD",
        "content": [
            {
                "代碼": "00",
                "代碼說明": "不分領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "01",
                "代碼說明": "語文領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "02",
                "代碼說明": "數學領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "03",
                "代碼說明": "社會領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "04",
                "代碼說明": "自然科學領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "05",
                "代碼說明": "藝術領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "06",
                "代碼說明": "綜合活動領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "07",
                "代碼說明": "科技領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "08",
                "代碼說明": "健康與體育領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "09",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "0A",
                "代碼說明": "跨領域科目專題",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0B",
                "代碼說明": "實作(實驗)及探索體驗",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0C",
                "代碼說明": "職涯試探",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0D",
                "代碼說明": "專題探究",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0E",
                "代碼說明": "跨領域/科目統整",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0F",
                "代碼說明": "通識性課程",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0G",
                "代碼說明": "大學預修課程",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0H",
                "代碼說明": "第二外國語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0I",
                "代碼說明": "本土語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "代碼": "0J",
                "代碼說明": "綜合活動與科技領域",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "0R",
                "代碼說明": "競技體育技能領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "0S",
                "代碼說明": "體育專業學科",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "0T",
                "代碼說明": "體育專項術科",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "代碼": "11",
                "代碼說明": "特殊需求領域(身心障礙)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "12",
                "代碼說明": "特殊需求領域(資賦優異)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "13",
                "代碼說明": "特殊需求領域(音樂專長)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "14",
                "代碼說明": "特殊需求領域(美術專長)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "15",
                "代碼說明": "特殊需求領域(舞蹈專長)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "16",
                "代碼說明": "特殊需求領域(戲劇專長)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "17",
                "代碼說明": "特殊需求領域(體育專長)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "18",
                "代碼說明": "特殊需求領域(實驗課程)",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "代碼": "91",
                "代碼說明": "藝術才能專長領域",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "92",
                "代碼說明": "生涯發展",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "93",
                "代碼說明": "職能探索",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "94",
                "代碼說明": "運動防護",
                "適用課程類型": "|H|S|"
            },
            {
                "代碼": "A1",
                "代碼說明": "數值控制技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "A2",
                "代碼說明": "精密機械製造技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "A3",
                "代碼說明": "模型設計與鑄造技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "A4",
                "代碼說明": "電腦輔助機械設計技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "A5",
                "代碼說明": "自動化整合技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "A6",
                "代碼說明": "金屬成形與管線技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "B1",
                "代碼說明": "車輛技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "B2",
                "代碼說明": "機器腳踏車技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "B3",
                "代碼說明": "液氣壓技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "B4",
                "代碼說明": "動力機械技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "C1",
                "代碼說明": "晶片設計技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "C2",
                "代碼說明": "微電腦應用技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "C3",
                "代碼說明": "自動控制技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "C4",
                "代碼說明": "電機工程技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "C5",
                "代碼說明": "冷凍空調技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "D1",
                "代碼說明": "化工技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "D2",
                "代碼說明": "紡染技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "E2",
                "代碼說明": "專業製圖技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "E3",
                "代碼說明": "土木測量技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "F1",
                "代碼說明": "商業與財會技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "F2",
                "代碼說明": "跨境商務技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "F3",
                "代碼說明": "資訊應用技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "G1",
                "代碼說明": "英語文技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "G2",
                "代碼說明": "日語文技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "G3",
                "代碼說明": "職場實務技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H1",
                "代碼說明": "平面設計技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H2",
                "代碼說明": "立體造形技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H3",
                "代碼說明": "數位成型技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H4",
                "代碼說明": "數位影音技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H5",
                "代碼說明": "互動媒體技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "H6",
                "代碼說明": "空間設計技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "I1",
                "代碼說明": "農業生產與休閒生態技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "I2",
                "代碼說明": "動物飼養及保健技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "J1",
                "代碼說明": "食品加工技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "J2",
                "代碼說明": "檢驗分析技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "K1",
                "代碼說明": "整體造型技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "K2",
                "代碼說明": "服裝實務技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "K3",
                "代碼說明": "生活應用技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "L1",
                "代碼說明": "廚藝技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "L2",
                "代碼說明": "烘焙技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "L3",
                "代碼說明": "旅宿技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "L4",
                "代碼說明": "旅遊技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M1",
                "代碼說明": "漁航技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M2",
                "代碼說明": "漁業技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M3",
                "代碼說明": "水域活動安全技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M4",
                "代碼說明": "觀賞水族技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M5",
                "代碼說明": "經濟水族技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M6",
                "代碼說明": "區域特色水族技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "M7",
                "代碼說明": "海面養殖技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N1",
                "代碼說明": "船舶金工技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N2",
                "代碼說明": "船舶機電控制技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N3",
                "代碼說明": "船舶動力技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N4",
                "代碼說明": "船舶作業技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N5",
                "代碼說明": "船舶操縱技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N6",
                "代碼說明": "電子導航技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "N7",
                "代碼說明": "船舶維護與繫固作業技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O1",
                "代碼說明": "視覺表現技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O2",
                "代碼說明": "展演製作技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O3",
                "代碼說明": "數位影音技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O4",
                "代碼說明": "音樂藝術技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O5",
                "代碼說明": "舞蹈藝術技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "O6",
                "代碼說明": "表演藝術實務技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U1",
                "代碼說明": "車輛整理技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U2",
                "代碼說明": "門市技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U3",
                "代碼說明": "物品整理技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U4",
                "代碼說明": "農園藝技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U5",
                "代碼說明": "產品加工技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U6",
                "代碼說明": "裝配技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U7",
                "代碼說明": "生活照護技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U8",
                "代碼說明": "家務處理技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "U9",
                "代碼說明": "餐飲製作技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UA",
                "代碼說明": "旅館房務技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UB",
                "代碼說明": "按摩技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UC",
                "代碼說明": "紓壓保健技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UD",
                "代碼說明": "民俗技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UE",
                "代碼說明": "寵物照顧技能領域",
                "適用課程類型": "|V|C|"
            },
            {
                "代碼": "UF",
                "代碼說明": "美髮技能領域",
                "適用課程類型": "|V|C|"
            }
        ]
    },
    {
        "name": "CATATT",
        "content": [
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "1A",
                "代碼說明": "語文",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "04",
                "代碼說明": "數學A類",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "05",
                "代碼說明": "數學B類",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "06",
                "代碼說明": "數學A版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "07",
                "代碼說明": "數學B版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "08",
                "代碼說明": "數學C版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "1B",
                "代碼說明": "社會",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0G",
                "代碼說明": "物理-探究A",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0H",
                "代碼說明": "化學-探究A",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0I",
                "代碼說明": "生物-探究A",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0J",
                "代碼說明": "地球科學-探究A",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0K",
                "代碼說明": "物理-探究B",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0L",
                "代碼說明": "化學-探究B",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0M",
                "代碼說明": "生物-探究B",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0N",
                "代碼說明": "地球科學-探究B",
                "適用課程類型": "|H|S|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0O",
                "代碼說明": "物理A版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0P",
                "代碼說明": "物理B版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0Q",
                "代碼說明": "化學A版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0R",
                "代碼說明": "化學B版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0S",
                "代碼說明": "生物A版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0T",
                "代碼說明": "生物B版",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "1C",
                "代碼說明": "自然科學",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "1D",
                "代碼說明": "藝術",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|V|C|M|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "1E",
                "代碼說明": "綜合活動",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "1F",
                "代碼說明": "科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "1G",
                "代碼說明": "健康與體育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "一般科目",
                "領域": "0J",
                "代碼": "1H",
                "代碼說明": "綜合活動與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械製造",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "機件原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械力學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "機械材料",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "應用力學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "引擎原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "底盤原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "基本電學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "電子學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "微處理機",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "電工機械",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "普通化學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "分析化學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "基礎化工",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "化工裝置",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "會計學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "經濟學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "設計概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "色彩原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "造形原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "農業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "食品加工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "食品微生物",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "家政概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "色彩概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "家政美學",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "水產概要",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "船藝",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "輪機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "海運概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "藝術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "服務導論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "經濟學概要",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "美容造型概論",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "美容職業安全與衛生",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "0S",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "0T",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "0T",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "01",
                "代碼說明": "水彩",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "02",
                "代碼說明": "水墨",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "03",
                "代碼說明": "版畫",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "04",
                "代碼說明": "美術鑑賞",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "05",
                "代碼說明": "書法",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "06",
                "代碼說明": "素描",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "07",
                "代碼說明": "基本設計",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "08",
                "代碼說明": "彩繪技法",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "09",
                "代碼說明": "創意表現",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0A",
                "代碼說明": "藝術鑑賞",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0B",
                "代碼說明": "主修",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0C",
                "代碼說明": "合奏",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0D",
                "代碼說明": "合唱",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0E",
                "代碼說明": "和聲",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0F",
                "代碼說明": "音樂史",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0G",
                "代碼說明": "音樂欣賞",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0I",
                "代碼說明": "副修",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0J",
                "代碼說明": "樂理",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0K",
                "代碼說明": "中國舞",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0L",
                "代碼說明": "芭蕾",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專業科目",
                "領域": "91",
                "代碼": "0M",
                "代碼說明": "現代舞",
                "適用課程類型": "|H|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "會計實務",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "牧場實習",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "77",
                "代碼說明": "農園場實習",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "78",
                "代碼說明": "農業資訊處理",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "79",
                "代碼說明": "寵物飼養與管理實習",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "水產增殖實習",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "基本電工實習",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "美髮實務",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "美顏實務",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A1",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A1",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A2",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A2",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A3",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A3",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A3",
                "代碼": "0C",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A4",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A4",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A4",
                "代碼": "0F",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A4",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A5",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A5",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A5",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A6",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A6",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "A6",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B1",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B1",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B1",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B2",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B2",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B3",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B3",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B4",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "B4",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C1",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C1",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C1",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C2",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C2",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C2",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C3",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C3",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C3",
                "代碼": "1C",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C4",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C4",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C4",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C5",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C5",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "C5",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "D1",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "D1",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "D2",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "D2",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "E2",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "E2",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "E3",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "E3",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F1",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F1",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F1",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F1",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F2",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F2",
                "代碼": "26",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F2",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F3",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F3",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "F3",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G1",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G2",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G3",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "G3",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H1",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H1",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H1",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H2",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H2",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H3",
                "代碼": "32",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H3",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H4",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H4",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H4",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H5",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H5",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H6",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "H6",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I1",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I1",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I1",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I1",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I2",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I2",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I2",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "I2",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "J1",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "J1",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "J2",
                "代碼": "3S",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "J2",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "J2",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K1",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K1",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K1",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K1",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K2",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K2",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K2",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K2",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K3",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K3",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K3",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "K3",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L1",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L1",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L2",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L3",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L3",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L4",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L4",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "L4",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M1",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M1",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M2",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M2",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M3",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M3",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M4",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M4",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M5",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M5",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M6",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M6",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M6",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M7",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "M7",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N1",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N1",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N2",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N2",
                "代碼": "54",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N3",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N3",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N4",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N4",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N4",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N5",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N5",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N6",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N6",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N7",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "N7",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O1",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O1",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O1",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O1",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O2",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O2",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O3",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O3",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O4",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O4",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O5",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O5",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O6",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "O6",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U1",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U1",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U1",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U2",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U2",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U2",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U3",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U3",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U3",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U4",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U4",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U4",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U5",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U5",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U5",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U6",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U6",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U6",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U7",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U7",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U7",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U8",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U8",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U8",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U9",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U9",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "U9",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UA",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UA",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UA",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UB",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UB",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UC",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UC",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "實習科目",
                "領域": "UC",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|V|C|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目",
                "領域": "0S",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目",
                "領域": "0T",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目",
                "領域": "0T",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0S",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0T",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "部定必修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0T",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "語文",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "社會",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "自然科學",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "藝術",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "綜合活動",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "健康與體育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "綜合活動與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|M|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械製造",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "機件原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "機械材料",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "應用力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "引擎原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "底盤原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "基本電學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "電子學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "微處理機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "電工機械",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "普通化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "分析化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "基礎化工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "化工裝置",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "會計學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "經濟學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "設計概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "色彩原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "造形原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "農業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "食品加工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "食品微生物",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "家政概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "色彩概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "家政美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "水產概要",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "船藝",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "輪機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "海運概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "藝術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "服務導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "經濟學概要",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "美容造型概論",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "美容職業安全與衛生",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "表演基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "戲曲身段基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "舞蹈基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "美髮實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "會計實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "牧場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "77",
                "代碼說明": "農園場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "78",
                "代碼說明": "農業資訊處理",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "79",
                "代碼說明": "寵物飼養與管理實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "水產增殖實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "基本電工實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "美髮實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "美顏實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "職前訓練",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂必修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國學常識",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "03",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "04",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "05",
                "代碼說明": "英語聽講",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "06",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "07",
                "代碼說明": "英文作文",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "08",
                "代碼說明": "數學甲",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "09",
                "代碼說明": "數學乙",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "10",
                "代碼說明": "基本設計",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "11",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "12",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "13",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "14",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "15",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "16",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "17",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "18",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "19",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "1A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "1B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "1C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-加深加廣選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "補強-國語文",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "補強-英語文",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "補強-數學",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "補強-歷史",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "補強-地理",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "補強-公民與社會",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "補強-物理",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "補強-化學",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "補強-生物",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "補強-地球科學",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "補強-音樂",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "補強-美術",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "補強-藝術生活",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "補強-生命教育",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "補強-生涯規劃",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "補強-家政",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "補強-生活科技",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "補強-資訊科技",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "補強-健康與護理",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "補強-體育",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-補強性選修",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "補強-全民國防教育",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|C|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-多元選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "不分屬性",
                "領域": "11",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "選修-其他",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "數學A",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "數學B",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "語文",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "社會",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "自然科學",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "藝術",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "綜合活動",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "健康與體育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "綜合活動與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|M|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "04",
                "代碼說明": "數學A",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "05",
                "代碼說明": "數學B",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械製造",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "機件原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "機械材料",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "應用力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "引擎原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "底盤原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "基本電學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "電子學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "微處理機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "電工機械",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "普通化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "分析化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "基礎化工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "化工裝置",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "會計學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "經濟學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "設計概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "色彩原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "造形原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "農業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "食品加工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "食品微生物",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "家政概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "色彩概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "家政美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "水產概要",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "船藝",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "輪機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "海運概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "藝術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "服務導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "經濟學概要",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "美容造型概論",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "美容職業安全與衛生",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "美髮實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "簡報實務",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "74",
                "代碼說明": "競技運動綜合訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "會計實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "牧場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "77",
                "代碼說明": "農園場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "78",
                "代碼說明": "農業資訊處理",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "79",
                "代碼說明": "寵物飼養與管理實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "水產增殖實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "基本電工實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "美髮實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "美顏實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "表演基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "戲曲身段基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "舞蹈基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "職前訓練",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "簡報實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "數學A",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "數學B",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "機械製造",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "機件原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "機械力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "機械材料",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "應用力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "引擎原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "底盤原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "基本電學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "電子學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7K",
                "代碼說明": "微處理機",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7L",
                "代碼說明": "電工機械",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7M",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7N",
                "代碼說明": "普通化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7O",
                "代碼說明": "分析化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7P",
                "代碼說明": "基礎化工",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7Q",
                "代碼說明": "化工裝置",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7R",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7S",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7T",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7U",
                "代碼說明": "商業概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7V",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7W",
                "代碼說明": "會計學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7X",
                "代碼說明": "經濟學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7Y",
                "代碼說明": "設計概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "7Z",
                "代碼說明": "色彩原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "80",
                "代碼說明": "造形原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "農業概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食品加工",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "食品微生物",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "89",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8A",
                "代碼說明": "家政概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8B",
                "代碼說明": "色彩概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8C",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8E",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8F",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8G",
                "代碼說明": "家政美學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8H",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8I",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8J",
                "代碼說明": "水產概要",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8K",
                "代碼說明": "船藝",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8L",
                "代碼說明": "輪機",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8M",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8N",
                "代碼說明": "海運概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8O",
                "代碼說明": "藝術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8P",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8Q",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8R",
                "代碼說明": "服務導論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8S",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8T",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8U",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8V",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "00",
                "代碼": "8W",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "03",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "04",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "05",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "06",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "07",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "20",
                "代碼說明": "國語文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "英語文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "02",
                "代碼": "08",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "02",
                "代碼": "09",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "02",
                "代碼": "22",
                "代碼說明": "數學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "02",
                "代碼": "75",
                "代碼說明": "數學A",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "02",
                "代碼": "76",
                "代碼說明": "數學B",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "0I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "23",
                "代碼說明": "歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "24",
                "代碼說明": "地理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "03",
                "代碼": "25",
                "代碼說明": "公民與社會",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "0Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "26",
                "代碼說明": "物理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "27",
                "代碼說明": "化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "28",
                "代碼說明": "生物",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "29",
                "代碼說明": "地球科學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "04",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "0Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "10",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "11",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "12",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "2A",
                "代碼說明": "音樂",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "2B",
                "代碼說明": "美術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "05",
                "代碼": "2C",
                "代碼說明": "藝術生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "13",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "14",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "15",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "2D",
                "代碼說明": "生命教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "2E",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "2F",
                "代碼說明": "家政",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "2G",
                "代碼說明": "法律與生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "06",
                "代碼": "2H",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "16",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "17",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "18",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "19",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "2I",
                "代碼說明": "生活科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "07",
                "代碼": "2J",
                "代碼說明": "資訊科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "08",
                "代碼": "1A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "08",
                "代碼": "1B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "08",
                "代碼": "1C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "08",
                "代碼": "2K",
                "代碼說明": "健康與護理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "08",
                "代碼": "2L",
                "代碼說明": "體育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "09",
                "代碼": "2M",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0S",
                "代碼": "8U",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0T",
                "代碼": "8V",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目",
                "領域": "0T",
                "代碼": "8W",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "簡報實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "數學A",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "數學B",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "機械製造",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "機件原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "機械力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "機械材料",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "應用力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "引擎原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "底盤原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "基本電學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "電子學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7K",
                "代碼說明": "微處理機",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7L",
                "代碼說明": "電工機械",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7M",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7N",
                "代碼說明": "普通化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7O",
                "代碼說明": "分析化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7P",
                "代碼說明": "基礎化工",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7Q",
                "代碼說明": "化工裝置",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7R",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7S",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7T",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7U",
                "代碼說明": "商業概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7V",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7W",
                "代碼說明": "會計學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7X",
                "代碼說明": "經濟學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7Y",
                "代碼說明": "設計概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "7Z",
                "代碼說明": "色彩原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "80",
                "代碼說明": "造形原理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "農業概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食品加工",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "食品微生物",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "89",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8A",
                "代碼說明": "家政概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8B",
                "代碼說明": "色彩概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8C",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8E",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8F",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8G",
                "代碼說明": "家政美學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8H",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8I",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8J",
                "代碼說明": "水產概要",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8K",
                "代碼說明": "船藝",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8L",
                "代碼說明": "輪機",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8M",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8N",
                "代碼說明": "海運概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8O",
                "代碼說明": "藝術概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8P",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8Q",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8R",
                "代碼說明": "服務導論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8S",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8T",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8U",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8V",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "00",
                "代碼": "8W",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "03",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "04",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "05",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "06",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "07",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "20",
                "代碼說明": "國語文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "英語文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "02",
                "代碼": "08",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "02",
                "代碼": "09",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "02",
                "代碼": "22",
                "代碼說明": "數學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "02",
                "代碼": "75",
                "代碼說明": "數學A",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "02",
                "代碼": "76",
                "代碼說明": "數學B",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "0I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "23",
                "代碼說明": "歷史",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "24",
                "代碼說明": "地理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "03",
                "代碼": "25",
                "代碼說明": "公民與社會",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "0Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "26",
                "代碼說明": "物理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "27",
                "代碼說明": "化學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "28",
                "代碼說明": "生物",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "29",
                "代碼說明": "地球科學",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "04",
                "代碼": "74",
                "代碼說明": "自然科學探究與實作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "0Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "10",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "11",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "12",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "2A",
                "代碼說明": "音樂",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "2B",
                "代碼說明": "美術",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "05",
                "代碼": "2C",
                "代碼說明": "藝術生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "13",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "14",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "15",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "2D",
                "代碼說明": "生命教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "2E",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "2F",
                "代碼說明": "家政",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "2G",
                "代碼說明": "法律與生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "06",
                "代碼": "2H",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "16",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "17",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "18",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "19",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "2I",
                "代碼說明": "生活科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "07",
                "代碼": "2J",
                "代碼說明": "資訊科技",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "08",
                "代碼": "1A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "08",
                "代碼": "1B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "08",
                "代碼": "1C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "08",
                "代碼": "2K",
                "代碼說明": "健康與護理",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "08",
                "代碼": "2L",
                "代碼說明": "體育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "09",
                "代碼": "2M",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0S",
                "代碼": "8U",
                "代碼說明": "運動學概論",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0T",
                "代碼": "8V",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "專精科目(核心科目)",
                "領域": "0T",
                "代碼": "8W",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|M|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "11",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "12",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "13",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "14",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "15",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "16",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "01",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "02",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "03",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "04",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "05",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "06",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "07",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "08",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "09",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0A",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0B",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0C",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "校訂選修",
                "科目屬性": "特殊需求領域",
                "領域": "17",
                "代碼": "0D",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "團體活動時間",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "團體活動時間",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "團體活動時間",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "班級活動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "團體活動時間",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "綜合活動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "彈性學習時間",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "彈性學習時間",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "基礎訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "基礎訓練",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職前訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "職前訓練",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "語文",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "社會",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "自然科學",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "藝術",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "綜合活動",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "健康與體育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "綜合活動與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械製造",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "機件原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "機械材料",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "應用力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "引擎原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "底盤原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "基本電學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "電子學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "微處理機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "電工機械",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "普通化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "分析化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "基礎化工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "化工裝置",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "會計學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "經濟學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "設計概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "色彩原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "造形原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "農業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "食品加工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "食品微生物",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "家政概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "色彩概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "家政美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "水產概要",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "船藝",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "輪機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "海運概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "藝術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "服務導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "經濟學概要",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "美容造型概論",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "美容職業安全與衛生",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "表演基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "戲曲身段基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "舞蹈基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "美髮實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "26",
                "代碼說明": "簡報實務",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "74",
                "代碼說明": "競技運動綜合訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "會計實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "牧場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "77",
                "代碼說明": "農園場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "78",
                "代碼說明": "農業資訊處理",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "79",
                "代碼說明": "寵物飼養與管理實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "水產增殖實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "基本電工實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "美髮實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "美顏實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "表演基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "戲曲身段基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "舞蹈基礎訓練",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "寒暑假課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "職前訓練",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|V|C|M|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|H|S|V|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "語文",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "社會",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "自然科學",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "藝術",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "綜合活動",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "健康與體育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "綜合活動與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "生活管理",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "社會技巧",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "學習策略",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "職業教育",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "溝通訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "點字",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "定向行動",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "功能性動作訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "輔助科技應用",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "創造力",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "領導才能",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "情意發展",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "獨立研究或專長領域",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "01",
                "代碼說明": "國語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "02",
                "代碼說明": "英語文",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "24",
                "代碼說明": "原住民族語文-噶瑪蘭語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "25",
                "代碼說明": "原住民族語文-邵語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "26",
                "代碼說明": "原住民族語文-魯凱語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "27",
                "代碼說明": "原住民族語文-賽夏語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "28",
                "代碼說明": "原住民族語文-排灣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "29",
                "代碼說明": "原住民族語文-賽德克語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2A",
                "代碼說明": "原住民族語文-泰雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2B",
                "代碼說明": "原住民族語文-布農語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2C",
                "代碼說明": "原住民族語文-鄒語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2D",
                "代碼說明": "原住民族語文-阿美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2E",
                "代碼說明": "原住民族語文-太魯閣語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2F",
                "代碼說明": "原住民族語文-拉阿魯哇語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2G",
                "代碼說明": "原住民族語文-撒奇萊雅語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2H",
                "代碼說明": "原住民族語文-卡那卡那富語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2I",
                "代碼說明": "原住民族語文-雅美語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "2J",
                "代碼說明": "原住民族語文-卑南語",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|H|S|M|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "41",
                "代碼說明": "國學常識",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "42",
                "代碼說明": "語文表達與傳播應用",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "43",
                "代碼說明": "各類文學選讀",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "44",
                "代碼說明": "專題閱讀與研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "45",
                "代碼說明": "英語聽講",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "46",
                "代碼說明": "英文閱讀與寫作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "01",
                "代碼": "47",
                "代碼說明": "英文作文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "03",
                "代碼說明": "數學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "48",
                "代碼說明": "數學甲",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "02",
                "代碼": "49",
                "代碼說明": "數學乙",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "09",
                "代碼說明": "歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0A",
                "代碼說明": "地理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "0B",
                "代碼說明": "公民與社會",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4A",
                "代碼說明": "族群、性別與國家的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4B",
                "代碼說明": "科技、環境與藝術的歷史",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4C",
                "代碼說明": "空間資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4D",
                "代碼說明": "社會環境議題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4E",
                "代碼說明": "現代社會與經濟",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4F",
                "代碼說明": "民主政治與法律",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4G",
                "代碼說明": "探究與實作：歷史學探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4H",
                "代碼說明": "探究與實作：地理與人文社會科學研究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "03",
                "代碼": "4I",
                "代碼說明": "探究與實作：公共議題與社會探究",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0C",
                "代碼說明": "物理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0D",
                "代碼說明": "化學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0E",
                "代碼說明": "生物",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "0F",
                "代碼說明": "地球科學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4J",
                "代碼說明": "選修物理-力學一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4K",
                "代碼說明": "選修物理-力學二與熱學",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4L",
                "代碼說明": "選修物理-波動、光及聲音",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4M",
                "代碼說明": "選修物理-電磁現象一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4N",
                "代碼說明": "選修物理-電磁現象二與量子現象",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4O",
                "代碼說明": "選修化學-物質與能量",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4P",
                "代碼說明": "選修化學-物質構造與反應速率",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Q",
                "代碼說明": "選修化學-化學反應與平衡一",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4R",
                "代碼說明": "選修化學-化學反應與平衡二",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4S",
                "代碼說明": "選修化學-有機化學與應用科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4T",
                "代碼說明": "選修生物-細胞與遺傳",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4U",
                "代碼說明": "選修生物-動物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4V",
                "代碼說明": "選修生物-生命的起源與植物體的構造與功能",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4W",
                "代碼說明": "選修生物-生態、演化及生物多樣性",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4X",
                "代碼說明": "選修地球科學-地質與環境",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "04",
                "代碼": "4Y",
                "代碼說明": "選修地球科學-大氣、海洋及天文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0U",
                "代碼說明": "音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0V",
                "代碼說明": "美術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "0W",
                "代碼說明": "藝術生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "4Z",
                "代碼說明": "表演創作",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "50",
                "代碼說明": "基本設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "51",
                "代碼說明": "多媒體音樂",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "05",
                "代碼": "52",
                "代碼說明": "新媒體藝術",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0X",
                "代碼說明": "生命教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Y",
                "代碼說明": "生涯規劃",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "0Z",
                "代碼說明": "家政",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "10",
                "代碼說明": "法律與生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "11",
                "代碼說明": "環境科學概論",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "53",
                "代碼說明": "未來想像與生涯進路",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "54",
                "代碼說明": "思考：智慧的啟航",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "06",
                "代碼": "55",
                "代碼說明": "創新生活與家庭",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "12",
                "代碼說明": "生活科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "13",
                "代碼說明": "資訊科技",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "56",
                "代碼說明": "工程設計專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "57",
                "代碼說明": "領域課程：科技應用專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "58",
                "代碼說明": "進階程式設計",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "07",
                "代碼": "59",
                "代碼說明": "領域課程：機器人專題",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "14",
                "代碼說明": "健康與護理",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "15",
                "代碼說明": "體育",
                "適用課程類型": "|V|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5A",
                "代碼說明": "安全教育與傷害防護",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5B",
                "代碼說明": "運動與健康",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "08",
                "代碼": "5C",
                "代碼說明": "健康與休閒生活",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "09",
                "代碼": "16",
                "代碼說明": "全民國防教育",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "31",
                "代碼說明": "日語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "32",
                "代碼說明": "法語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "33",
                "代碼說明": "德語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "34",
                "代碼說明": "西班牙語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "35",
                "代碼說明": "越南語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "36",
                "代碼說明": "印尼語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "37",
                "代碼說明": "泰國語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "38",
                "代碼說明": "緬甸語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "39",
                "代碼說明": "柬埔寨語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3A",
                "代碼說明": "菲律賓語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0H",
                "代碼": "3B",
                "代碼說明": "馬來西亞語",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "21",
                "代碼說明": "客家語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "22",
                "代碼說明": "原住民族語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "一般科目",
                "領域": "0I",
                "代碼": "23",
                "代碼說明": "閩南語文",
                "適用課程類型": "|M|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械製造",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "機件原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "機械材料",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "應用力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "引擎原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "底盤原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "基本電學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "電子學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "數位邏輯設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "微處理機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0C",
                "代碼說明": "電工機械",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "冷凍空調原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "普通化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0F",
                "代碼說明": "分析化學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "基礎化工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "化工裝置",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "土木建築工程與技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "構造與施工法",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "基礎工程力學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "商業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "數位科技概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "會計學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "經濟學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "設計概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "色彩原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "造形原理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "創意潛能開發",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "設計與生活美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "農業概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "生物技術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "農業安全衛生",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "生命科學概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "食品加工",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "食品微生物",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "食品化學與分析",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "家政概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "色彩概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "家政職業衛生與安全",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "家庭教育",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "家政職業倫理",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "行銷與服務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "家政美學",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "觀光餐旅業導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "觀光餐旅英語會話",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "水產概要",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "船藝",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1C",
                "代碼說明": "輪機",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "海上安全法規概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "海運概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "藝術概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "藝術欣賞",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "藝術與科技",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "服務導論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "衛生與安全概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "事務機器與電腦應用概論",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "運動學概論",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "專項體能訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "專項技術訓練",
                "適用課程類型": "|H|S|V|M|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "經濟學概要",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "美容造型概論",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "美容職業安全與衛生",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7F",
                "代碼說明": "表演基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7G",
                "代碼說明": "戲曲身段基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7H",
                "代碼說明": "音樂基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "7I",
                "代碼說明": "舞蹈基礎訓練",
                "適用課程類型": "|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "81",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "82",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "83",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "84",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "85",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "86",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "87",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "專業科目",
                "領域": "00",
                "代碼": "88",
                "代碼說明": "美髮實務",
                "適用課程類型": "|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "機械基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "基礎電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "機械製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "電腦輔助製圖與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "電腦輔助設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "07",
                "代碼說明": "數值控制機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "08",
                "代碼說明": "電腦輔助製造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "09",
                "代碼說明": "綜合機械加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0A",
                "代碼說明": "鑄造實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0B",
                "代碼說明": "模型製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0D",
                "代碼說明": "機械工作圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0E",
                "代碼說明": "實物測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0G",
                "代碼說明": "電腦輔助機械設計製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0H",
                "代碼說明": "氣油壓控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0I",
                "代碼說明": "機電實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0J",
                "代碼說明": "機電整合實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0K",
                "代碼說明": "金屬成形實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0L",
                "代碼說明": "銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0M",
                "代碼說明": "金屬管線實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0N",
                "代碼說明": "機械工作法及實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0O",
                "代碼說明": "機電製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0P",
                "代碼說明": "引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Q",
                "代碼說明": "底盤實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0R",
                "代碼說明": "電工電子實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0S",
                "代碼說明": "電系實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0T",
                "代碼說明": "車輛空調檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0U",
                "代碼說明": "車輛底盤檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0V",
                "代碼說明": "車身電器系統綜合檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0W",
                "代碼說明": "機器腳踏車基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0X",
                "代碼說明": "機器腳踏車檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Y",
                "代碼說明": "液氣壓基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "0Z",
                "代碼說明": "液氣壓檢修實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "10",
                "代碼說明": "動力機械操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "11",
                "代碼說明": "動力機械引擎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "12",
                "代碼說明": "基本電學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "13",
                "代碼說明": "電子學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "14",
                "代碼說明": "程式設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "15",
                "代碼說明": "可程式邏輯設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "16",
                "代碼說明": "單晶片微處理機實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "17",
                "代碼說明": "行動裝置應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "18",
                "代碼說明": "微電腦應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "19",
                "代碼說明": "介面電路控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1A",
                "代碼說明": "電工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1B",
                "代碼說明": "可程式控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1D",
                "代碼說明": "智慧居家監控實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1E",
                "代碼說明": "電力電子應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1F",
                "代碼說明": "電工機械實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1G",
                "代碼說明": "能源與冷凍實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1H",
                "代碼說明": "能源與空調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1I",
                "代碼說明": "節能技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1J",
                "代碼說明": "普通化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1K",
                "代碼說明": "分析化學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1L",
                "代碼說明": "化工裝置實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1M",
                "代碼說明": "化工儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1N",
                "代碼說明": "紡染實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1O",
                "代碼說明": "紡染檢驗實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1P",
                "代碼說明": "測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Q",
                "代碼說明": "設計與技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1R",
                "代碼說明": "營建技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1S",
                "代碼說明": "材料與試驗",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1T",
                "代碼說明": "製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1U",
                "代碼說明": "電腦輔助製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1V",
                "代碼說明": "建築製圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1W",
                "代碼說明": "施工圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1X",
                "代碼說明": "工程測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Y",
                "代碼說明": "地形測量實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "1Z",
                "代碼說明": "數位科技應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "20",
                "代碼說明": "商業溝通",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "21",
                "代碼說明": "門市經營實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "22",
                "代碼說明": "行銷實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "23",
                "代碼說明": "會計軟體應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "24",
                "代碼說明": "金融與證券投資實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "25",
                "代碼說明": "國際貿易實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "27",
                "代碼說明": "貿易英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "28",
                "代碼說明": "多媒體製作與應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "29",
                "代碼說明": "程式語言與設計",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2A",
                "代碼說明": "資料庫應用",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2B",
                "代碼說明": "初階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2C",
                "代碼說明": "中階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2D",
                "代碼說明": "高階英語聽講練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2E",
                "代碼說明": "初階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2F",
                "代碼說明": "中階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2G",
                "代碼說明": "高階英文閱讀與寫作練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2H",
                "代碼說明": "英文商業書信寫作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2I",
                "代碼說明": "日語聽解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2J",
                "代碼說明": "日語聽解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2K",
                "代碼說明": "日語文型練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2L",
                "代碼說明": "日語翻譯練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2M",
                "代碼說明": "日語讀解入門練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2N",
                "代碼說明": "日語讀解初階練習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2O",
                "代碼說明": "日文商用書信實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2P",
                "代碼說明": "外語簡報實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Q",
                "代碼說明": "外語文書處理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2R",
                "代碼說明": "繪畫基礎實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2S",
                "代碼說明": "表現技法實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2T",
                "代碼說明": "基本設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2U",
                "代碼說明": "基礎圖學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2V",
                "代碼說明": "電腦向量繪圖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2W",
                "代碼說明": "數位影像處理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2X",
                "代碼說明": "圖文編排實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Y",
                "代碼說明": "基礎攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "2Z",
                "代碼說明": "印刷與設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "30",
                "代碼說明": "立體造形設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "31",
                "代碼說明": "立體造形實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "33",
                "代碼說明": "數位成型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "34",
                "代碼說明": "數位與商業攝影實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "35",
                "代碼說明": "影音製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "36",
                "代碼說明": "影音剪輯實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "37",
                "代碼說明": "網頁設計實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "38",
                "代碼說明": "動畫製作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "39",
                "代碼說明": "室內設計與製圖實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3A",
                "代碼說明": "室內裝修實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3B",
                "代碼說明": "農業資訊管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3C",
                "代碼說明": "農園場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3D",
                "代碼說明": "林場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3E",
                "代碼說明": "牧場管理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3F",
                "代碼說明": "植物栽培實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3G",
                "代碼說明": "農業資源應用實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3H",
                "代碼說明": "植物識別實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3I",
                "代碼說明": "植物保護實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3J",
                "代碼說明": "解剖生理實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3K",
                "代碼說明": "動物飼養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3L",
                "代碼說明": "動物保健實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3M",
                "代碼說明": "動物營養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3N",
                "代碼說明": "食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3O",
                "代碼說明": "食品微生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3P",
                "代碼說明": "食品化學與分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Q",
                "代碼說明": "烘焙食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3R",
                "代碼說明": "進階食品加工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3T",
                "代碼說明": "食品檢驗分析實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3U",
                "代碼說明": "生物技術實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3V",
                "代碼說明": "多媒材創作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3W",
                "代碼說明": "飾品設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3X",
                "代碼說明": "美容美體實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Y",
                "代碼說明": "美髮造型實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "3Z",
                "代碼說明": "舞台表演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "40",
                "代碼說明": "整體造型設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "41",
                "代碼說明": "服裝製作實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "42",
                "代碼說明": "服裝畫實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "43",
                "代碼說明": "立體裁剪實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "44",
                "代碼說明": "服裝設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "45",
                "代碼說明": "嬰幼兒發展照護實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "46",
                "代碼說明": "膳食與營養實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "47",
                "代碼說明": "幼兒教保活動設計與實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "48",
                "代碼說明": "家庭生活管理實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "49",
                "代碼說明": "餐飲服務技術",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4A",
                "代碼說明": "飲料實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4B",
                "代碼說明": "中餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4C",
                "代碼說明": "西餐烹調實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4D",
                "代碼說明": "烘焙實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4E",
                "代碼說明": "房務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4F",
                "代碼說明": "旅館客務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4G",
                "代碼說明": "旅遊實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4H",
                "代碼說明": "導覽解說實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4I",
                "代碼說明": "遊程規劃實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4J",
                "代碼說明": "水產生物實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4K",
                "代碼說明": "航海與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4L",
                "代碼說明": "海圖作業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4M",
                "代碼說明": "漁具漁法與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4N",
                "代碼說明": "航海儀器實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4O",
                "代碼說明": "專業海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4P",
                "代碼說明": "潛水實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Q",
                "代碼說明": "水質學實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4R",
                "代碼說明": "觀賞水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4S",
                "代碼說明": "餌料生物實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4T",
                "代碼說明": "經濟性魚蝦養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4U",
                "代碼說明": "區域特色水族養殖實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4V",
                "代碼說明": "水族營養飼料學與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4W",
                "代碼說明": "水產增殖專業實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4X",
                "代碼說明": "基礎海上安全實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Y",
                "代碼說明": "水產增殖基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "4Z",
                "代碼說明": "基本電工與實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "50",
                "代碼說明": "船舶自動控制實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "51",
                "代碼說明": "船舶金工實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "52",
                "代碼說明": "船舶銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "53",
                "代碼說明": "船舶電器操作與保養實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "55",
                "代碼說明": "動力設備操作實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "56",
                "代碼說明": "動力設備拆裝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "57",
                "代碼說明": "船藝實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "58",
                "代碼說明": "海圖作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "59",
                "代碼說明": "航海英文實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5A",
                "代碼說明": "航海實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5B",
                "代碼說明": "船舶通訊實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5C",
                "代碼說明": "雷達與測繪實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5D",
                "代碼說明": "電子航儀實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5E",
                "代碼說明": "基礎銲接實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5F",
                "代碼說明": "繩纜作業實習",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5G",
                "代碼說明": "展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5H",
                "代碼說明": "音樂展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5I",
                "代碼說明": "表演藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5J",
                "代碼說明": "視覺藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5K",
                "代碼說明": "音像藝術展演實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5L",
                "代碼說明": "繪畫基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5M",
                "代碼說明": "素描實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5N",
                "代碼說明": "數位設計實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5O",
                "代碼說明": "版面編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5P",
                "代碼說明": "多媒材實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Q",
                "代碼說明": "劇場技術基礎實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5R",
                "代碼說明": "數位攝錄影實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5S",
                "代碼說明": "影音後製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5T",
                "代碼說明": "音樂基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5U",
                "代碼說明": "音樂創作基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5V",
                "代碼說明": "舞蹈基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5W",
                "代碼說明": "舞蹈編排實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5X",
                "代碼說明": "表演基礎實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Y",
                "代碼說明": "肢體與聲音創作實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "5Z",
                "代碼說明": "基礎清潔實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "60",
                "代碼說明": "基礎清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "61",
                "代碼說明": "職場清潔實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "62",
                "代碼說明": "顧客服務實務",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "63",
                "代碼說明": "顧客服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "64",
                "代碼說明": "車輛外部清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "65",
                "代碼說明": "車輛內裝清理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "66",
                "代碼說明": "車輛美容實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "67",
                "代碼說明": "基礎設備實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "68",
                "代碼說明": "收銀台實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "69",
                "代碼說明": "門市作業實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6A",
                "代碼說明": "物品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6B",
                "代碼說明": "倉儲實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6C",
                "代碼說明": "配送實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6D",
                "代碼說明": "農園藝種植維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6E",
                "代碼說明": "園藝景觀維護管理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6F",
                "代碼說明": "農園管理維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6G",
                "代碼說明": "基礎蔬果加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6H",
                "代碼說明": "基礎雜糧作物加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6I",
                "代碼說明": "基礎香草加工實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6J",
                "代碼說明": "組裝技能實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6K",
                "代碼說明": "代工品組裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6L",
                "代碼說明": "商品包裝實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6M",
                "代碼說明": "生活保健實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6N",
                "代碼說明": "居家照顧實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6O",
                "代碼說明": "飲食調理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6P",
                "代碼說明": "生活用品整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Q",
                "代碼說明": "家電使用與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6R",
                "代碼說明": "家事處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6S",
                "代碼說明": "食材處理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6T",
                "代碼說明": "基礎速食實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6U",
                "代碼說明": "飲料調製實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6V",
                "代碼說明": "客房整理實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6W",
                "代碼說明": "客房清潔與維護實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6X",
                "代碼說明": "客房服務實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Y",
                "代碼說明": "按摩基礎手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "6Z",
                "代碼說明": "局部按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "70",
                "代碼說明": "基礎精油物品實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "71",
                "代碼說明": "基礎精油按摩手法實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "72",
                "代碼說明": "足部精油按摩實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "73",
                "代碼說明": "專題實作",
                "適用課程類型": "|V|C|E|F|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "75",
                "代碼說明": "會計實務",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "76",
                "代碼說明": "牧場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "77",
                "代碼說明": "農園場實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "78",
                "代碼說明": "農業資訊處理",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "79",
                "代碼說明": "寵物飼養與管理實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7A",
                "代碼說明": "水產增殖實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7B",
                "代碼說明": "基本電工實習",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7C",
                "代碼說明": "美髮實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7D",
                "代碼說明": "美顏實務",
                "適用課程類型": "|E|F|C|V|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7E",
                "代碼說明": "職涯體驗",
                "適用課程類型": "|E|F|C|"
            },
            {
                "課程類別": "返校課程",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "7J",
                "代碼說明": "職前訓練",
                "適用課程類型": "|V|E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "職業技能訓練(一)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "職業技能訓練(二)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "職業技能訓練(三)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "職業技能訓練(四)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "職業技能訓練(五)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "不分屬性",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "職業技能訓練(六)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "01",
                "代碼說明": "職業技能訓練(一)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "02",
                "代碼說明": "職業技能訓練(二)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "03",
                "代碼說明": "職業技能訓練(三)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "04",
                "代碼說明": "職業技能訓練(四)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "05",
                "代碼說明": "職業技能訓練(五)",
                "適用課程類型": "|V||E|F|"
            },
            {
                "課程類別": "職業技能訓練",
                "科目屬性": "實習科目",
                "領域": "00",
                "代碼": "06",
                "代碼說明": "職業技能訓練(六)",
                "適用課程類型": "|V||E|F|"
            }
        ]
    },
    {
        "name": "SCH",
        "content": [
            {
                "代碼": "H",
                "代碼說明": "普通型高中"
            },
            {
                "代碼": "V",
                "代碼說明": "技術型高中"
            },
            {
                "代碼": "M",
                "代碼說明": "綜合型高中"
            },
            {
                "代碼": "S",
                "代碼說明": "單科型高中"
            },
            {
                "代碼": "C",
                "代碼說明": "進修部"
            },
            {
                "代碼": "E",
                "代碼說明": "實用技能學程(日)"
            },
            {
                "代碼": "F",
                "代碼說明": "實用技能學程(夜)"
            },
            {
                "代碼": "G",
                "代碼說明": "建教合作班"
            }
        ]
    },
    {
        "name": "MOD",
        "content": [
            {
                "代碼": "0",
                "代碼說明": "原班級"
            },
            {
                "代碼": "1",
                "代碼說明": "跨班選修(班群開課)"
            },
            {
                "代碼": "2",
                "代碼說明": "綜高跨年級選修"
            },
            {
                "代碼": "A",
                "代碼說明": "同科單班選修"
            },
            {
                "代碼": "B",
                "代碼說明": "同科跨班選修"
            },
            {
                "代碼": "C",
                "代碼說明": "同群跨科選修(技術型、進修部適用)"
            },
            {
                "代碼": "C",
                "代碼說明": "跨學程  (綜高適用)"
            },
            {
                "代碼": "D",
                "代碼說明": "同校跨群選修"
            },
            {
                "代碼": "E",
                "代碼說明": "跨校選修"
            }
        ]
    },
    {
        "name": "ATT1",
        "content": [
            {
                "代碼": "0",
                "代碼說明": "不分屬性"
            },
            {
                "代碼": "1",
                "代碼說明": "一般科目"
            },
            {
                "代碼": "2",
                "代碼說明": "專業科目"
            },
            {
                "代碼": "3",
                "代碼說明": "實習科目"
            },
            {
                "代碼": "4",
                "代碼說明": "專精科目"
            },
            {
                "代碼": "5",
                "代碼說明": "專精科目(核心科目)"
            },
            {
                "代碼": "6",
                "代碼說明": "特殊需求領域"
            },
            {
                "代碼": "A",
                "代碼說明": "自主學習"
            },
            {
                "代碼": "B",
                "代碼說明": "選手培訓"
            },
            {
                "代碼": "C",
                "代碼說明": "充實(增廣)、補強性教學\n[全學期、不授予學分]"
            },
            {
                "代碼": "D",
                "代碼說明": "充實(增廣)、補強性教學\n[全學期、授予學分]"
            },
            {
                "代碼": "E",
                "代碼說明": "學校特色活動"
            }
        ]
    },
    {
        "name": "TEST",
        "content": [
            {
                "name": "zoe"
            }
        ]
    }
];

export const ApiResponse = [
  {
      "實施學年度": 108,
      "課程類型": "H",
      "MD5": "bafe2dd876b3c3fd0701521376798ea5",
      "課程資料": [
          {
              "課程代碼": "108041305H11101A1010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "444422",
              "授課學期開課方式": "000000",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101A1010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "444420",
              "授課學期開課方式": "00000-",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101A1010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305H11101A1010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "220200",
              "授課學期開課方式": "00-0--",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101A101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101A101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "B2B000",
              "授課學期開課方式": "000---",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101A101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "111100",
              "授課學期開課方式": "0000--",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101A101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "110011",
              "授課學期開課方式": "00--00",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101A1010712",
              "科目名稱": "生活科技",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101A1010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101A1010815",
              "科目名稱": "體育",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "000000",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305H11101A2110A90",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101A2110A91",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101A5110B90",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101A5110B92",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101A5110D90",
              "科目名稱": "由電影看社會",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "11----",
              "課程屬性": "510D"
          },
          {
              "課程代碼": "108041305H11101A5110F90",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101A5110F97",
              "科目名稱": "商務英語",
              "授課學期學分節數": "0B0000",
              "授課學期開課方式": "-1----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101A8100001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "333333",
              "授課學期開課方式": "111111",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305H11101A9100001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "111111",
              "課程屬性": "9000"
          },
          {
              "課程代碼": "108041305H11101B1010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "444422",
              "授課學期開課方式": "000000",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101B1010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "444420",
              "授課學期開課方式": "00000-",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305H11101B1010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305H11101B1010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "222000",
              "授課學期開課方式": "000---",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "220200",
              "授課學期開課方式": "00-0--",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305H11101B101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101B101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "B2B000",
              "授課學期開課方式": "000---",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305H11101B101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "111100",
              "授課學期開課方式": "0000--",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101B101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "110011",
              "授課學期開課方式": "00--00",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305H11101B1010712",
              "科目名稱": "生活科技",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101B1010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305H11101B1010815",
              "科目名稱": "體育",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "000000",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305H11101B2110A90",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101B2110A91",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "210A"
          },
          {
              "課程代碼": "108041305H11101B5110B90",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101B5110B92",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "BB0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510B"
          },
          {
              "課程代碼": "108041305H11101B5110D90",
              "科目名稱": "由電影看社會",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "11----",
              "課程屬性": "510D"
          },
          {
              "課程代碼": "108041305H11101B5110F90",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101B5110F97",
              "科目名稱": "商務英語",
              "授課學期學分節數": "0B0000",
              "授課學期開課方式": "-1----",
              "課程屬性": "510F"
          },
          {
              "課程代碼": "108041305H11101B8100001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "333333",
              "授課學期開課方式": "111111",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305H11101B9100001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "222222",
              "授課學期開課方式": "111111",
              "課程屬性": "9000"
          }
      ]
  },
  {
      "實施學年度": 108,
      "課程類型": "M",
      "MD5": "cc7fd415b32ac97a099c14890cbd956c",
      "課程資料": [
          {
              "課程代碼": "108041305M1119601010101",
              "科目名稱": "國語文",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305M1119601010102",
              "科目名稱": "英語文",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1101"
          },
          {
              "課程代碼": "108041305M1119601010203",
              "科目名稱": "數學",
              "授課學期學分節數": "440000",
              "授課學期開課方式": "00----",
              "課程屬性": "1102"
          },
          {
              "課程代碼": "108041305M1119601010309",
              "科目名稱": "歷史",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305M111960101030A",
              "科目名稱": "地理",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1103"
          },
          {
              "課程代碼": "108041305M111960101040C",
              "科目名稱": "物理",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305M111960101040D",
              "科目名稱": "化學",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1104"
          },
          {
              "課程代碼": "108041305M111960101050U",
              "科目名稱": "音樂",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "00----",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305M111960101050V",
              "科目名稱": "美術",
              "授課學期學分節數": "B20000",
              "授課學期開課方式": "00----",
              "課程屬性": "1105"
          },
          {
              "課程代碼": "108041305M111960101060Y",
              "科目名稱": "生涯規劃",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "1106"
          },
          {
              "課程代碼": "108041305M1119601010713",
              "科目名稱": "資訊科技",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "1107"
          },
          {
              "課程代碼": "108041305M1119601010814",
              "科目名稱": "健康與護理",
              "授課學期學分節數": "110000",
              "授課學期開課方式": "00----",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305M1119601010815",
              "科目名稱": "體育",
              "授課學期學分節數": "220000",
              "授課學期開課方式": "00----",
              "課程屬性": "1108"
          },
          {
              "課程代碼": "108041305M1119601010916",
              "科目名稱": "全民國防教育",
              "授課學期學分節數": "110000",
              "授課學期開課方式": "00----",
              "課程屬性": "1109"
          },
          {
              "課程代碼": "108041305M111960201030B",
              "科目名稱": "公民與社會",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "0-----",
              "課程屬性": "2103"
          },
          {
              "課程代碼": "108041305M111960201040E",
              "科目名稱": "生物",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-0----",
              "課程屬性": "2104"
          },
          {
              "課程代碼": "108041305M1119607110090",
              "科目名稱": "生活禮儀",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7100"
          },
          {
              "課程代碼": "108041305M1119607110091",
              "科目名稱": "職業試探",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7100"
          },
          {
              "課程代碼": "108041305M1119607110190",
              "科目名稱": "人文閱讀與探索",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110191",
              "科目名稱": "日語入門",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110192",
              "科目名稱": "生活英文",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7101"
          },
          {
              "課程代碼": "108041305M1119607110390",
              "科目名稱": "台灣觀光地理",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7103"
          },
          {
              "課程代碼": "108041305M1119607110490",
              "科目名稱": "生活中的科學",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7104"
          },
          {
              "課程代碼": "108041305M1119607110491",
              "科目名稱": "科普實作與體驗",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7104"
          },
          {
              "課程代碼": "108041305M1119607110590",
              "科目名稱": "設計概論",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110591",
              "科目名稱": "插畫表現技法",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110592",
              "科目名稱": "跟著音樂去旅行",
              "授課學期學分節數": "020000",
              "授課學期開課方式": "-1----",
              "課程屬性": "7105"
          },
          {
              "課程代碼": "108041305M1119607110610",
              "科目名稱": "法律與生活",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7106"
          },
          {
              "課程代碼": "108041305M1119607110790",
              "科目名稱": "初階程式設計",
              "授課學期學分節數": "200000",
              "授課學期開課方式": "1-----",
              "課程屬性": "7107"
          },
          {
              "課程代碼": "108041305M1119607110890",
              "科目名稱": "健康魔法師",
              "授課學期學分節數": "2B0000",
              "授課學期開課方式": "11----",
              "課程屬性": "7108"
          },
          {
              "課程代碼": "108041305M1119608D00001",
              "科目名稱": "團體活動時間",
              "授課學期學分節數": "330000",
              "授課學期開課方式": "DD----",
              "課程屬性": "8000"
          },
          {
              "課程代碼": "108041305M1119609D00001",
              "科目名稱": "彈性學習時間",
              "授課學期學分節數": "220000",
              "授課學期開課方式": "DD----",
              "課程屬性": "9000"
          }
      ]
  }
];