
/** 班群代碼表。 */
export const GroupNameChart = {
    "實施學年度": 108,
    "MD5": "f52c1d63865f8dd9e2175784610cd7eb",
    "班群資料": [
        {
            "適用入學學年度": 108,
            "課程類型": "C",
            "群別代碼": "27",
            "科別代碼": "433",
            "班群": "A",
            "班群名稱": "外語商貿人才班"
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "26",
            "科別代碼": "401",
            "班群": "0",
            "班群名稱": ""
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "26",
            "科別代碼": "402",
            "班群": "0",
            "班群名稱": ""
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "26",
            "科別代碼": "404",
            "班群": "0",
            "班群名稱": ""
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "27",
            "科別代碼": "433",
            "班群": "0",
            "班群名稱": ""
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "27",
            "科別代碼": "433",
            "班群": "A",
            "班群名稱": "外語商貿人才班"
        },
        {
            "適用入學學年度": 108,
            "課程類型": "V",
            "群別代碼": "28",
            "科別代碼": "406",
            "班群": "0",
            "班群名稱": ""
        }
    ]
};